{
    "0.518": {
        "Fixes": [
            "- Fixed missing 'unavailable_for_calls' attribute when loading a save."
        ]
    },
    "0.517": {
        "Additions": [
            "- Added warning that you are filtering by a specific mod to mod manager."
        ],
        "Fixes": [
            "- Fixed error during home visits with events because 'selected_girl' is cleared."
        ]
    },
    "0.516": {
        "Changes": [
            "- Changed GirlManager 'blacklisted_girls' to a list of girl ids rather than actual objects."
        ],
        "Fixes": [
            " - '_generate_save_error_prevention_file' now correctly generates missing classes and functions.",
            "- Added extra check to prevent events adding their directory path to files that already have it.",
            "- Fixed performance issue when removing girls from locations.",
            "- 'uninstall_mod' now checks if mod is installed before trying to uninstall.",
            "- Fixed 'install_missing_requirements' trying to install already installed mods."
        ],
        "Modding Changes": [
            "- Added 'unavailable_hangout_locations' attribute to girls, can be used to limit where girls can hang out.",
            "- Added 'unavailable_for_class' attribute to girls, can be used to prevent them from going to classes.",
            "- Added 'unavailable_for_calls' attribute to girls, can be used to prevent being able to call them.",
            "- Added 'unavailable_at_home' attribute to girls and mothers, can be used to prevent them be seen at home.",
            "- Added 'discovered' states for traits, along with 'discovery_requirements' and 'undiscovered_description' to allow discovering automatically."
        ]
    },
    "0.515": {
        "Fixes": [
            "- Added error catching for syntax errors in 'get_tooltip_height'.",
            "- '_run_install_mod' no longer deletes archives when the install fails.",
            "- '_handle_mod_unzipping' now deletes partial installs if it fails."
        ]
    },
    "0.514": {
        "Changes": [
            "- 'modify_events_menu' now separates events by type.",
            "- Added white text to back button.",
            "- Added tooltips to why academy shortcuts are unavailable.",
            "- Events where a girl masturbates now has her 'cum' method called so it is tracked and cum is added to her clothing.",
            "- 'bathroom_masturbation_tips' now has her 'cum' method called so it is tracked and cum is added to her clothing.",
            "- Added trans character support to 'sexual favor' menu options.",
            "- Added special dialogue if girl isn't wearing underwear after 'home_visit_discuss_daughter_sexual_favor_strip_naked'."
        ],
        "Fixes": [
            "- Fixed not being able to load saves when in offline mode because the game things there is a hotfix.",
            "- Fixed cum covered image variants not being generated correctly.",
            "- Fixed academy shortcuts using text meant to be tooltips.",
            "- Fixed uniform rule breaks not being added when 'bikini' clothing blocks layers.",
            "- Made sure 'force_start_event' clears participants before deepcopy for performance."
        ],
        "Modding Changes": [
            "- Added filter requirement support to tease, masturbate and cheating exam events.",
            "- Added 'database_valid_webm_main_tags' and 'database_valid_webm_sub_tags' where modders can add their tags to the valid tag lists.",
            "- Added 'force_generic_event' method EventManager to test generic events more easily. Takes 'event_id' and 'participant_ids' as arguments."
        ]
    },
    "0.513": {
        "Changes": [
            "- Highlighted required mods when not installed.",
            "- Added new exit button to locations.",
            "- Slightly increased tooltip xmaximum, to avoid 'allowance multipliers' being on a new row."
        ],
        "Fixes": [
            "- Hid 'content_breakdown' for mods where it shouldn't be visible.",
            "- Fixed girls not leaving exam when they should."
        ]
    },
    "0.512": {
        "Fixes": [
            "- Fixed invalid impact range for 'furry_handcuffs' gift."
        ]
    },
    "0.511": {
        "Fixes": [
            "- Added check to prevent 'get_tooltip_height' checking empty text.",
            "- Fixed error in 'scale_impacts_to_player_force' when assistant performs actions."
        ]
    },
    "0.510": {
        "Additions": [
            "- Added variant for blowjob intro line in the locker room for girls not in the shower.",
            "- Added 'tenacity' to retry failed downloads."
        ],
        "Changes": [
            "- Set 'autoreload' to False and removed warnings about reloading files.",
            "- Changed intro naturism strings to show its what she prefers.",
            "- Mods with requirements/mod packs now take downloading and installing mods into account."
        ],
        "Fixes": [
            "- Fixed mod manager download progress not being cleared because of float rounding.",
            "- Hid the 'delete archives' button for mod packs unless you actually have some downloaded archives.",
            "- Fixed notification inconsistencies.",
            "- Fixed intro clothing strings missing a space.",
            "- Mod packs now take installed mods into account to show the 'install' over 'download' button.",
            "- Fixed 'furry_handcuffs' reducing fear rather than increasing it.",
            "- Fixed selecting a sponsor item to replace selecting the next item in the list."
        ]
    },
    "0.508": {
        "Additions": [
            "- Added 'auto select' button to sponsor overview menu.",
            "- Added gameplay setting to toggle mothers using the same last name as their daughter.",
            "- Added gameplay setting to toggle mothers ignoring race mismatches for daughters.",
            "- Added gameplay setting to set duration of notifications.",
            "- Added gameplay setting to set media set size for videos/images.",
            "- Added gameplay setting to reset exam schedules at the end of each week.",
            "- Added gameplay setting to set boredom factor.",
            "- Added gameplay setting to set which impacts are ignored by the boredom factor.",
            "- Added new rules to increase girl applications and max pending applications.",
            "- 'girl_recruitment_menu' now shows girls they share content with.",
            "- Added custom wallpapers for the phone.",
            "- Added missing function error prevention when loading saves.",
            "- Added achievements system framework.",
            "- Added 'arousal', 'pressure' and 'tolerance' to 'girl_stat_growth_multipliers'.",
            "- Added search bar to girl review menu.",
            "- Added 'market', 'true' and 'base' value sorting options to clothing collection."
        ],
        "Changes": [
            "- Action force levels can now specify what stats they change and by how much rather than a single multiplier for all.",
            "- Trait, Girl and Sponsor names now use coloured outlines rather than flat colours.",
            "- 'get_matching_files' uses 'lower' function to avoid not matching because of case.",
            "- 'all_shoot_backgrounds' now only collects from a specific directory for performance.",
            "- 'compatibility_updates' now only run if the saves version doesn't match the games version.",
            "- 'get_all_matching_images' now makes sure '.webp' is in the search terms.",
            "- Increased 'girl_webm_bonus' value range from 0-20 to 0-50.",
            "- '_get_match_rating' now uses 'is_girl_webm' to improve performance of checking a list of Webm objects.",
            "- Consolidated Webm and ActionImage code to reduce duplicate code.",
            "- Consolidated WebmHelper and ImageHelper code to reduce duplicate code.",
            "- Added early exclude check to 'get_matching_files'.",
            "- Changed 'renpy.exists' calls to 'renpy.loadable'.",
            "- Added 'blowjob' to 'oral_fixation' traits tolerated actions.",
            "- 'oral_fixation' trait now also increases mouth sensitivity by 20%",
            "- 'anal_slut' is now earned by making a girl cum from anal sex 5+ times.",
            "- MediaHelper 'media_set_size' of 1 now picks a webm from the best group randomly rather than always the first one in the group.",
            "- MediaHelper 'media_set_size' now has a minimum of 1 rather than 0.",
            "- Added variations of orgasm lines based on the number of times the girl has cum in thee interaction.",
            "- Improved consistency and scalability of action impacts and related functions.",
            "- Separated arousal/pressure and stat change multipliers for player force levels, to allow better customizability.",
            "- Removed impact ranges for all action impacts to improve consistency.",
            "- 'remove_girl_id_from_location' now also generates a new outfit and body images for girls.",
            "- Added player impact reduction when they are not performing the action. 50% by default and controlled by 'not_player_doing_action_multiplier'.",
            "- MediaHelper 'has_video', 'has_custom_video', 'has_image' and 'has_custom_image' now support lists of girls.",
            "- Rebalanced Girl '_calculate_fear_impact_from_pressure_or_arousal' method and 'calculate_fear_impact' function. Uncorrupted girls will generate get more fear early on.",
            "- Changed default min and max outer wear chance from 50-10 to 75-15.",
            "- 'mother_selection_menu' now shows mother images.",
            "- Shared shoots now show up on all participant's pages.",
            "- Integrated example mods into the base game.",
            "- Removed bonus acceptance during sex interactions.",
            "- Added pressure < 80 check to most during exam events.",
            "- Changed various screens 'sort by' options to be dropdown menus."
        ],
        "Fixes": [
            "- Fixed 'is_wearing_maid_outfit' and 'is_wearing_nurse_outfit' returning incorrectly when wearing 'sexy' outfits.",
            "- Android variant of 'get_matching_files' now lowers directories because they randomly become uppercase when packaging.",
            "- Added missing 'show_boobs' tag to 'database_shoot_item_sub_tag_lewdness'.",
            "- Fixed Event 'is_off_cooldown' taking 'same_participant_cooldown' even if it doesn't use participants.",
            "- Added close button to 'upgrades_side_menu'.",
            "- Fixed girls not in class commenting about you cumming on her panties.",
            "- Fixed 'generic_action_cum_on_panties' not applying impacts if the owner isn't in class.",
            "- Fixed 'selected_uniform_set' not resetting on NG+",
            "- Fixed ExamManager 'generate_girls_in_class' possibly picking the same girl multiple times.",
            "- Fixed 'cum_dumpster' and 'cum_slut' traits not increasing sensitivity correctly.",
            "- Fixed 'generic_action_forced_uniform_attendance' jumping to home label.",
            "- Fixed 'selected_request' being defaulted as an empty list.",
            "- Fixed being able to punish a girl during home visits if she is at work.",
            "- Fixed computer buttons to being indexed correctly if their index is already taken.",
            "- Fixed typo causing pc wallpapers to not be found from '_mods/pc_wallpapers'",
            "- Fixed 'girl_name' video match and mismatch bonuses being inverted.",
            "- Fixed 'home_visit_discuss_daughter_confiscate_clothing' not taking clothing which cannot be purchased into account.",
            "- Made notification timers more consistent.",
            "- Fixed 'scale_impacts_to_player_force' inverting the multipliers, meaning more forceful was actually reducing impacts...",
            "- Fixed error in 'office_event_student_wants_extra_money' when girl doesn't accept payment immediately.",
            "- Fixed some unintended exam update stuff running for girls and player on actions with 0 time cost. Mainly debug actions.",
            "- Fixed possible errors when updating player items.",
            "- Made sure Girl 'apply_impacts_from_db' doesn't take girl motivation or rule tolerance into account during exam events.",
            "- Fixed 'tolerance' being affected by girls motivation multiplier.",
            "- Fixed error when to expelling a girl.",
            "- Fixed a ton of inconsistencies and calculation errors when applying impacts to girls.",
            "-Fixed 'get_daughter_ids_and_mother_configs' not working when a girl is pending.",
            "- Fixed girl events with multiple trigger locations not being added when they should."
        ],
        "Modding Changes": [
            "- Changed 'webm_helper' to 'media_helper', it now handles both video and image files.",
            "- Added 'database_inventory_items' where items which cannot be purchased can be added so they don't get removed from the players inventory when updating.",
            "- Girls now load extra content from the 'addons' folder.",
            "- Added 'tick_box' argument to 'confirm_user_choice' screen. If the box was ticked 'dont_show_again_was_ticked' will be True.",
            "- Added 'whore_plus' tag for videos, they will only be shown if the girl is at 'whore' or greater corruption level.",
            "- Added 'database_after_load_updates' and 'time_manager.mark_after_load_update' as ways to make functions to be run once after the game loads.",
            "- Choice menu tooltips now calls 'replace_variables_in_text' on the text before displaying.",
            "- Location based events now separate participants into 'girl', 'mother' or 'any' for either.",
            "- Moved 'unknown.webp' out of 'images/body' to 'images' base folder.",
            "- Added 'current_label' global variable which is a string of the current label name.",
            "- Added 'all_i', 'wu_i' and 'wd_i' tags for videos. These can be used to ignore all clothing tags, above waist and below waist respectively.",
            "- Added optional 'run_updates_early' argument to ExamAction. If True exam round updates are run before your action label.",
            "- Added 'database_general_targeted_exam_actions' and section for 'general' actions while a girl is selected during exams.",
            "- Added variables to manage min, max applications and max pending applications.",
            "- Added 'max_pending_applications', 'min_academy_applications' and 'max_academy_applications' variables which control girl application limits.",
            "- Added 'tease_lower_ass' and 'tease_lower_pussy' video tag support.",
            "- Added global 'sleep_remember_location'. If True when using 'jump sleep' it will take the player back to that location when waking up.",
            "- Added 'exam_cum_count' attribute to girls which tracks how many times they have cum during the current exam, like the 'sex_interaction_cum_count' for sex interactions.",
            "- Added 'get_cum_amount_on_part' and 'get_location_tag' methods to Girl class.",
            "- 'all_clothing_images' now only collects modded images from '_mods/clothing'.",
            "- Improved how clothing handles girl specific clothing images. They are now loaded from addon locations as well and stored within the girls 'image_manager.clothing_images'",
            "- Added custom wallpapers for the phone. 'show phone' and 'hide phone' should be changed to 'show screen phone_screen' and 'hide screen phone_screen'.",
            "- Added PC and phone wallpaper requirement support by adding them to 'database_wallpaper_requirements'.",
            "- Added location support for fullbody and body images these are just prioritized for those locations. i.e 'clothed-park' or 'underwear-park,pier'",
            "- Made it easier to add threesome sex actions by letting wrapper labels handle character selection."
        ]
    }
}
