{
    "0.406": {
        "Added": [
            "- Added compatibility functions to make the update 0.35 compatible(probably)."
        ],
        "Changes": [
            "- Made event location girl lists a bit less 'brittle'.",
            "- Waiting around in locations past closing time will now kick you out."
        ],
        "Fixed": [
            "- Remove requirements to use bathroom, since it is meant to be unisex.",
            "- Fixed some references using 'girls_in_bar' rather than 'girls_at_bar'.",
            "- Fixed length of 'girls_in_park'."
        ]
    },
    "0.405a-beta": {
        "Fixed": [
            "- Fixed compatibility fix for girl list variables not running."
        ]
    },
    "0.405-beta": {
        "Added": [
            "- Added 'Head to class' and 'Attend PTA meeting' buttons to academy navigation screen.",
            "- You can now set buttplug vibration levels during sex interactions.",
            "- 'generic_action_player_choose_cum' now also sets the 'chosen_cum_action' to the chosen label.",
            "- Accessing budget via debug management menu will let you easily add funds.",
            "- Accessing upgrades via debug management menu will let bypass faculty/upgrade requirement, instantly build them and do it for free."
        ],
        "Changes":[
            "- Buttplugs only apply impacts after inserting.",
            "- Adding an image to the random wallpaper pool now enables the randomizer.",
            "- Scolding a girl after praising her now removed the 'Praised' buff.",
            "- Removed daily grades decay."
        ],
        "Fixed": [
            "- Loads of typo and grammar fixes.",
            "- Bathroom is now correctly unlocked after gloryhole upgrade.",
            "- Fixed error when washing panties from sponsor request screen.",
            "- Added missing 'cum_amount' variable to mothers.",
            "- Fixed clothing tooltip showing it as damaged when it isn't.",
            "- Limited strip tease videos to non-nude girls.",
            "- Player 'modify_cash' now rounds values.",
            "- Fixed 'sell_all_clothing' breaking clothing categories.",
            "- Fixed double orgasm videos during exam.",
            "- Fixed 'teaching_assistant_discussion_where_is_everyone' displaying two lines and them incorrectly.",
            "- Fixed not being able to scroll upgrades in academy navigation screen.",
            "- Cancelling giving a gift no longer blocks it.",
            "- Fixed quick overview girls being incorrect when starting home visits from certain locations.",
            "- Fixed incorrect descriptions for 'exam_event_girl_caught_cheating_office_face_fuck' when cumming on mother.",
            "- Fixed error when sorting girls by grades if mothers are in the list.",
            "- Now main participant is sorted to the top of girl cum targets.",
            "- Fixed error when selecting 'clinic_discussion_mental_checkup'.",
            "- Fixed location girl lists length changing when girls are removed from location.",
            "- Fixed teachers not being assigned.",
            "- Fixed not being able to scold girls that aren't wearing clothing in forced types.",
            "- Fixed incorrect check to return to mother during home visits."
        ]
    },
    "0.404-beta": {
        "Added": [
            "- Added bikini images for Kiara Cole and Shay Sights."
        ],
        "Fixed": [
            "- Fixed error when trying attributes during home visit.",
            "- Fixed dialogue line when girls leave closing with you after exam.",
            "- Fixed error when using restroom.",
            "- Fixed error when visiting clinic when nurse isn't assigned.",
            "- Locations now clear out when their requirements become unmet.",
            "- You will now get kicked out when locations close.",
            "- Fixed double 'remove upper' actions for certain clothing.",
            "- Fixed missing images for sexy nurse bra and thong.",
            "- 'all_clothing_images' now excludes map navigation and sponsor folders.",
            "'home_visit_discuss_daughter_sexual_favor_options' now shows full body image.",
            "- Fixed the same girls being assigned to class everyday.",
            "- Fixed error when fulfilling girl sponsor requests.",
            "- Fixed 'girls_in_exam' not clearing after daily update."
        ]
    },
    "0.403-beta": {
        "Added": [
            "- Added notification how much a girls grades increase during cheating event.",
            "- Added check for unrecognized files in shoot directories i.e incorrect file types."
        ],
        "Fixed": [
            "- Fixed 'big' buttons when selecting cum targets.",
            "- Fixed buttplug remotes not being added correctly when inserting buttplug.",
            "- Fixed error when selecting  'bathroom_masturbation_tips' dialogue option.",
            "- Fixed various errors when interacting with girls in locations.",
            "- Fixed blocking girl names when trying to enter locations.",
            "- Fixed selling clothing not removing item from collection.",
            "- Fixed error when selecting photos for sponsor requests.",
            "- Fixed multiple delimiters causing errors when creating girl ratings.",
            "- Fixed errors when checking video indexes caused when generating girl rating."
        ]
    },
    "0.402-beta": {
        "Fixed": [
            "- Fixed rare shader error on some systems.",
            "- Fixed video not hiding when girl retrieves her cum covered panties.",
            "- Fixed 'deepcopy' error when trying to add temporary trait.",
            "- Fixed missing sex labels for wedgie and spanking.",
            "- Fixed choice button text being cut off."
        ]
    },
    "0.401-beta": {
        "Fixed": [
            "- Fixed 'sexy_nurse_dress' missing image.",
            "- Fixed error when apologizing and leaving locker room.",
            "- Fixed 'inspection' dialogue line being too long.",
            "- Fixed being able to click girl face to bypass bathroom/locker_room requirements.",
            "- Fixed error when checking mother traits for 'step mother' trait.",
            "- Fixed errors in 'bathroom_masturbation_tips' label.",
            "- Fixed incorrect label for 'bathroom_apologize_and_leave'",
            "- Fixed error when calling 'update_blocking_girl_names'.",
            "- 'girl_selection_menu' now sorts the girls correctly when reopening.",
            "- Fixed error when choosing where to cum if there are no additional subtags."
        ]
    },
    "0.4-beta": {
        "Added": [
            "- Added city navigation map.",
            "- Added stealing and selling any clothing items.",
            "- Added 'nurse' faculty position which will have her working in the clinic.",
            "- Added new visitable locations to school: clinic, cafeteria, locker room.",
            "- Added new visitable locations to map: beach, mall, pier.",
            "- Player 'cum limit' is now visible during sex interactions.",
            "- During sex interactions if the player just came and the girl leaves you will either end early or get a prompt to continue.",
            "- Added sorting options to panty collection and girl recruitment screens.",
            "- Added 'ultimate whore' trait, mainly by modder request to allow 'reward' videos.",
            "- Added 'face'/'mouth' area sensitivity for girls.",
            "- Allowed modding in custom PC backgrounds, you can see the 'game/_mods/pc_backgrounds' folder for more details.",
            "- Added outlines to buttons to make them easier to distinguish between.",
            "- Added button to clear class.",
            "- Allowed marking images as wallpapers and randomizing wallpaper based on them when opening computer.",
            "- Added sorting options to girl assignment screen.",
            "- Added sorting and filtering options to girl review screen.",
            "- Added option to skip the videos and dialogue of strip events during exam.",
            "- Girl body parts can now also be covered in cum.",
            "- Body images will now try to match if the girl has a buttplug and/or part is covered in cum.",
            "- Added 'squirter' trait, which increases how much a girl cums when she orgasms.",
            "- Added option to completely skip the shoot introduction dialogue.",
            "- Added advanced filtering and searching when starting shoots.",
            "- Added 'fake boob' traits for each size.",
            "- Added force buttplug and force vibrating buttplug rules.",
            "- Added 'image_helper', functionally the same as 'webm_helper' but for static images.",
            "- Added event details to girl quick overview screen.",
            "- Added new clothing: 'bikini', 'micro bikini', 'peekaboo bikini', 'mini dress' and 'latex dress'",
            "- Added option to not strip girls when sex interactions start.",
            "- Re-added 'story_event_first_girl_leaving' story event.",
            "- Added options to cum on the girls ass or pussy in various situations.",
            "- Added dialogue option for secretary to call a girl into your office.",
            "- Added sexy nurse outfit, if given to the academy nurse she will wear it to work."
        ],
        "Changes": [
            "- Clothing now keeps track of who came on/in it and how much cum there is.",
            "- 'Take break' sex action now reduces player arousal by 10 from 5 and girl arousal by 5 rather than 5-10.",
            "- Max student rules now increase capacity by 3 from 2 but require at least one of the classrooms to be renovated.",
            "- 'Being A Slut' homework subject now requires 'Free-Use Law: Act 3' to be passed. It now also increases the girls obedience and people skills.",
            "- Starting sex interactions via debug menu now randomize the girls used.",
            "- Actions which normally don't make the player cum have their arousal impacts on the player reduced by 50% during sex interactions.",
            "- Cumming no longer reduces girls intellect.",
            "- '_exam_round_arousal_change' now raises the girl arousal to 85 rather than not increasing at all if arousal change would tag ger above 85.",
            "- Reduced player arousal from 'pinch_nipple' action from 10 to 5-10.",
            "- When asked to get dressed girls will remark if they didn't wear any clothing to work.",
            "- By popular request girls can again cum from blowjobs/face fucking.",
            "- Shoot review screen now only shows relevant sub tags. i.e They can be requested by a sponsor.",
            "- Forced pantyless and uniform rules no longer conflict.",
            "- SponsorRequest 'get_random_lewdness' now takes requested clothing tags into account.",
            "- Allowed generating mothers with conflicting hair colours if they are all that is left.",
            "- Ending home visits now takes you to navigation screen which allows quickly call another girl or go to another location.",
            "- Homework and class subjects now show their requirements.",
            "- Moved Girl and Mother payment and clothing purchasing to Sunday, to allow purchasing forced clothing types and tags.",
            "- Debug mode can now be disabled by using the same code again.",
            "- Event first trigger chance can now also be modified on the event settings screen.",
            "- Hovering girls during assignment now shows their stats.",
            "- Video tags marked with '_only' now get +3, special tags defined in 'database_special_only_tags' get +10.",
            "- WebmHelper now gets location tags automatically based on location or current event 'type'.",
            "- 'global_current_location_label' now pulls valid labels from 'database_valid_global_location_labels' to allow modding in new locations.",
            "- 'debug_show_management_menu' now opens on the 'rules' tab.",
            "- Normalized and improved 'get_uncovered_parts_tooltip'",
            "- Updated and improved some widget images.",
            "- Increased the number of 'fuck_ass' actions needed for 'anal_slut' from 7 to 10.",
            "- Separated the 'cum_slut' into 'cum_slut' and 'cum_dumpster' based on where the cumshot is(external vs internal)",
            "- Girls now carry over some pressure, arousal and tolerance changes from exam inspection.",
            "- Shortened shoot introduction dialogue.",
            "- You can now modify the universal growth rate for each stat from the computer settings screen.",
            "- Added 'swimsuit' tag to 'onepiece_swimsuit'.",
            "- Daughter stat influence can now be set to 0 so she will not corrupt her mother at all.",
            "- Improved event detailing on girl review screen.",
            "- Mother and daughter full body images now show during home visits if they have one.",
            "- Made all exam actions available during sex interactions.",
            "- 'office_event_secretary_work_late' can now trigger after 2PM rather than after 4PM",
            "- Applying pressure or arousal impacts now also increase fear based on girl corruption.",
            "- Uncorrupted girls now get small amounts of corruption and naturism XP based on the other girl's outfits. So now you can pair girls who dress slutty with uncorrupted girls to boost their corruption speed.",
            "- Various 'step mother' traits should allow mismatched races between girls now.",
            "- Girls now get dressed after sex.",
            "- You can now see all students on graduation screen."
        ],
        "Fixed": [
            "- Classes are generated in the morning now if the player skips class.",
            "- Fixed cancelled buttplug insertions being reported.",
            "- Fixed possible error checking clothing tags if buttplug was not inserted.",
            "- Fixed error when cancelling passing/expelling girl after calling mother from PC.",
            "- Made sure player and girl 'just_came' flags are reset after actions.",
            "- Made sure player 'just_came' flag is reset after gloryhole.",
            "- Made sure time manager unlocks correctly after interacting with gloryhole.",
            "- Fixed girls which are in class being available in the gloryhole. This is if the player skips class.",
            "- Based sure videos with mismatched races being played when they shouldn't.",
            "- Made sure 'scheduled_auxiliary_teachers' are correctly cleared when starting new game+",
            "- Fixed debug management menu not unlocking rules.",
            "- Fixed possible errors when deleting girls if they are auxiliary teachers.",
            "- Fixed clothing possibly being seen when adding it to girls wardrobe when it shouldn't.",
            "- Fixed possible error when updating stolen buttplugs.",
            "- Debug sex interactions no longer use the 'home visit' end scene.",
            "- Fixed girls 'leaving' sex interactions on the last round.",
            "- Fixed punishments not updating and being removed correctly.",
            "- Fixed no video or lines playing if selected girl cums from buttplug.",
            "- Fixed possible dialogue line issues when giving girls gifts.",
            "- Fixed girls refusing gifts not applying their refuse impacts.",
            "- Girls who have temporarily left class no longer get impacts.",
            "- Shoot 'can_be_attempted' now returns False if its required rule isn't passed.",
            "- Fixed possible issue getting clothing name for reported exam actions when removing shoes.",
            "- Fixed shoes not being checked for rule breaks when removing them(would be tolerated).",
            "- Added missing shoot item sub tags to 'database_shoot_item_sub_tag_lewdness'.",
            "- Fixed teachers not being correctly unassigned when deleting girls and mothers.",
            "- Fixed 'double facial' videos being played when they shouldn't.",
            "- Fixed shoot callouts being incorrect for the fallback options.",
            "- Fixed shoes and buttplugs not being marked as seen.",
            "- Fixed some not setting their return label correctly if their event type was a list.",
            "- Added missing 'lingerie' clothing tag to Lace Panties.",
            "- Fixed not being able to name the academy if skipping intro and selecting girls.",
            "- Fixed 'generic_action_rimjob' using the wrong video tag for female assistant.",
            "- Fixed headmaster 'cb_id' not being set after starting new game+",
            "- Fixed error caused by vibrating buttplugs.",
            "- 'generic_action_player_choose_cum' now makes sure its the player doing the action before continuing.",
            "- Fixed 'exam_event_girl_caught_masturbating' using the wrong sub tags.",
            "- Fixed possible error when getting maintained faculty tooltip.",
            "- 'hovering_autoshoot' should now clear more consistently.",
            "- Fixed clothing not being taken from the girls during exam intro.",
            "- Fixed mothers possibly having mismatched 'clothing_manager' objects.",
            "- Fixed 'get_valid_events' including disabled events and one time events which have triggered.",
            "- Fixed sleeping after midnight skipping a day.",
            "- Fixed 'post_exam_update' doubling grade gain for girls in player class."
        ],
        "Modding Changes": [
            "- Girl body images will now try to match a chosen index if possible. Allowing images sets i.e 'face1' will try to match with 'portrait1', 'boobs1' and so on.",
            "- Girl body images can be tagged using 'cum', 'creampie' and 'bp' to help match scenarios. 'creampie' being used by face, ass and pussy. 'bp' used only for ass and means she is wearing a buttplug.",
            "- Videoshoot thumbnails can now be tagged with ',cover' like photoshoot photos.",
            "- ShootItem 'analyze_item_name' fixes more incorrect tags mainly to do with '_vert' tags added to sub tags.",
            "- Completed sponsor requests now keep track of the girl ids if applicable.",
            "- HomeworkSubject now supports giving girls traits upon lesson completion.",
            "- Gifts now support applying temporary buffs. See 'game/scripts/main_classes/class_shop_item_ren.py' for more details.",
            "- Girl ratings screen now also warns about incorrect shoot main and sub tags.",
            "- Girl ratings will now only be generated once per load rather than every time the screen is opened.",
            "- Girl ratings will now be generated on multiple threads rather than 1 by 1(about twice as fast now).",
            "- Added panty types to clothing tags.",
            "- Changed the way girl id's as video tags is weighted. Should make videos with matching girl ids more common.",
            "- Added 'park' event type, triggered when travelling through it, such as to and from academy.",
            "- Added 'waited_around' variable which is True if the player waited via the HUD. Can be used to limit when your events can/can't trigger.",
            "- Events can check if it was started via dialogue using 'event_started_from_dialogue'.",
            "- Added 'dialogue_text' argument to Event class. This is used as the dialogue option text if event can be started via dialogue.",
            "- Added stand alone 'show_video' and 'hide_video' functions.",
            "- Added 'add_clothing_tags' function which allows more easily adding tags to clothing items.",
            "- Added 'possible_clothing_request_sub_tags' and 'favored_clothing_item_sub_tags' to Sponsors. Allowing sponsors to request items with that tag or favored clothing to get a match bonus.",
            "- Added support for temporary traits by giving them a 'duration_in_days' argument.",
            "- Added 'add_temporary_trait' method to TraitManager.",
            "- Raised 'too many photos' from 35 to 45.",
            "- Raised 'too many videos' from 15 to 30.",
            "- Girl ratings now check image aspect ratios rather than exact dimensions.",
            "- Fixed temporary stat changes not working for area sensitivity i.e 'ass_sensitivity'.",
            "- Added 'webm_tags_for_girls_to_ignore' for GirlRatings clarity.",
            "- Renamed 'actions_already_done' for home visits to 'actions_already_done_home_visit' since the former is now used for other locations.",
            "- Allowed modding in new fullbody image keys and requirements. See 'game/scripts/databases/fullbody_image_tags_ren.py' for more details.",
            "- Added 'database_webm_inclusive_trait_tag_mapping' where you can tag certain traits to add multiple tags i.e 'big_boobs_fake' will also add 'big_boobs' as tag.",
            "- Added support for static images to be shown like videos, these images should be tagged the same as the videos and be put into an 'action_videos' folder within the girl folder.",
            "- Added 'force_orgasm' argument to most generic actions. It forces the target girl to cum if she didn't already.",
            "- Added 'add_to_trait_influences_to_entries' utility function, allows applying 'trait influences' to multiple entries at once.",
            "- Added 'insert_dict_entry_at_index' and 'add_or_merge_entry' utility functions. Can be used to help add new dialogue/descriptions or adjectives.",
            "- Changed how home visit actions are tracked to function more closely to other locations. Mods might been to be update their requirements for this i.e 'my_action' not in actions_already_done -> 'my_action' not in actions_already_done[girl.id].",
            "- Added clothing tag 'non_school' and 'non_work' to prevent girls from wearing it to school/work.",
            "- Added support for modding in different event type 'girl lists'. i.e 'shoot' event types using the girls in the shoot.",
            "- Added support for 'female_orgasm' which will play over 'orgasm' if person doing the action is another girl.",
            "- 'caught cheating' event now pulls its options from several databases allowing users to mod in new options."
        ]
    }
}
