{
    "0.312g": {
        "Changes": [
            "- Improved performance of 'home visit call menu'.",
            "- Improved performance of 'confiscate clothing menu'."
        ],
        "Fixed": [
            "- Fixed possible errors when checking event availability.",
            "- Fixed sex options disappearing after switching selected parts."
            ]
    },
    "0.312f": {
        "Fixed": [
            "- Fixed icons such as the wallpaper icon being placed off screen."
        ]
    },
    "0.312e": {
        "Added": [
            "- Added 'shoes' layer and clothing support.",
            "- Added image button to show when update is available.",
            "- Added toggle to hide 'remove' and 'strip' video tags in girl rating menu.",
            "- Added PC icon to set computer backgrounds, this has been a feature no one ever found"
        ],
        "Changes": [
            "- Improved event availablity tooltips.",
            "- Improved performance of 'modify_events_menu'.",
            "- Improved performance of 'shoot studio' menu.",
            "- Improved performance of 'shoot' menu.",
            "- Improved performance of 'sex interaction' menu.",
            "- Improved performance of 'girl_ratings_menu' screen.",
            "- Improved performance of 'pta meeting' screens.",
            "- Improved performance of 'show_ubuy_menu'.",
            "- Improved performance of 'new_game_plus'.",
            "- Made 'fuck_thighs' available unless legs are covered, which does not currently include long pants."
        ],
        "Fixed": [
            "- Fixed error when analyzing girl shoots causing errors when viewing girl ratings.",
            "- Fixed girls appearing in exam outro screen that shouldn't.",
            "- Fixed girl subject progress not being displayed when assigning homework from girl review menu.",
            "- Fixed possible error with 'office_event_mother_missed_tuition_payment' if girl and mother share ids(mod issue).",
            "- Fixed shared events and shoots possibly being removed after reloading saves.",
            "- Fixed girl rating not counting shared shoots.",
            "- Fixed possible error causing incorrect girl being selected after an event because 'temporary_girl' was not being cleared.",
            "- Fixed transparency on some lower clothing images causing strange layering issues."
        ]
    },
    "0.312d": {
        "Added": [
            "- Added option to only randomly generate 6 girls when starting NewGame+"
        ],
        "Changes": [
            "- Right click now clears selected upgrade selection rather than closing screens if possible."
        ],
        "Fixed": [
            "- Fixed girl answer progress will now use either the exam action time or the remaining exam time, whichever is lower.",
            "- Fixed hiding UI during photoshoots to causing visual issues.",
            "- PTA Meetings are now greyed out if you already missed it rather than dialogue indicating so.",
            "- Fixed girls not knowing you were coming after calling her but visiting her mother.",
            "- Fixed time not advancing when 'dream' events trigger.",
            "- Fixed error when trying to check girl ratings.",
            "- Fixed inconsistencies in rule dependancies being disabled when disabling rules.",
            "- Fixed pending girls not clearing after ending application selection early when starting NewGame+",
            "- Exam manager now regenerates girls if class isn't filled due to removing modded girls.",
            "- Fixed pending girls/mothers not being deleted cleanly causing errors when deleting them.",
            "- Rework say screen and how character images and names are set."
        ]
    },
    "0.312c": {
        "Fixed": [
            "- Fixed rollback issue caused by discussing reported actions or requests during home visits."
        ]
    },
    "0.312b": {
        "Fixed": [
            "- Fixed some errors caused while trying to clear None type objects.",
            "- Fixed events possibly triggering immediately after loading a save."
        ]
    },
    "0.312a": {
        "Fixed": [
            "- Fixed band-aid fix for major save game bloat caused by rollback data being saved.",
            "- Fixed error when applying temporary stat changes and girl doesn't have attribute.",
            "- Fixed error when generating display name for shoot items.",
            "- Selected girl is now remembered even after during exam events."
        ]
    },
    "0.312": {
        "Added": [
            "- Added 'refresh' button when selecting intial girls.",
            "- Added 'Viagra' consumable item to uBuy store.",
            "- Added right-click to close shortcut to 99% of menus with a close button."
        ],
        "Changes": [
            "- Uniform skirt now covers both ass and pussy.",
            "- Mothers of deleted girls will be reassignable if they were randomly assigned to her.",
            "- When starting a new game+ you now only need to pick a minimum of 6 girls.",
            "- Panty collect 'blurb' is now only shown once per day.",
            "- Made player inventory accessible during exams and sex interactions.",
            "- Lowered 'base_time_between_stages' for bathroom exam event.",
            "- Lowered default exam duration to 80 minutes from 100, this will not change existing saves.",
            "- Made some changes to how rule checks and outfit generation is done to make it more consistent.",
            "- Rebalanced girl answer progress during exams.",
            "- Rebalanced all exam actions to be less severe if they are 'shorter' than before rework."
        ],
        "Fixed": [
            "- Fixed 'Furry Handcuffs' fear again showing as positive/green.",
            "- Fixed girl/mother specific home visit events trigger when visiting other girls.",
            "- Fixed stolen and collected panties/buttplugs not updating with new attributes.",
            "- Fixed error when multiple girls report exam actions.",
            "- Fixed clothing items being duplicated when giving gifts.",
            "- Fixed gift selection UI having some icons cut off.",
            "- Fixed pending girls not being removed cleanly.",
            "- Fixed 'confiscate_clothing' acceptance calculation.",
            "- Fixed requirement description for removing panties/buttplug during sex.",
            "- Fixed homework descriptions after exam not showing the correct progress for girls.",
            "- Fixed girls 'breaking' forced outless when ",
            "- Fixed possible errors caused by clothing not updating correctly.",
            "- Fixed girls starting with some progress if class duration was changed from default.",
            "- Fixed rare case where 0 report chance actions were being reported."
        ],
        "Modding Changes": [
            "- Added support for consumable items.",
            "- Added list support for mother 'daughter_id', allowing modders to specify multiple girls she could be assigned to i.e 'daughter_id': ['piper_perri', 'elsa_jean'].\nThey are still only assigned to 1 girl.",
            "- Changed 'gift_type' argument to 'item_type', kept backwards compatibility but will need to be changed in the future."
        ]
    },
    "0.311b": {
        "Fixed": [
            "- Fixed error when ending sex interactions, caused by trying to fix another bug.",
            "- Fixed non-generic mother home visit events not triggering."
        ]
    },
    "0.311a": {
        "Changes": [
            "- Class time can now be lowered down to 60 minutes from a minimum of 100.",
            "- Girl should break rules that they disagree with more consistently now.",
            "- Added some extra checks when checking whether a girl should wear or skip clothing."
        ],
        "Fixed": [
            "- Fixed possible error when changing min and max wear chance sliders.",
            "- Fixed exams ending immediately if a pre-exam event happens.",
            "- Fixed error when using debug options to add panties.",
            "- Fixed descriptions and reactions referencing girls from sex interactions during in class facials.",
            "- Fixed duplicated line when punishing mother.",
            "- Fixed 'Tuition Increase $200' requirement description being incorrect.",
            "- Fixed possible incorrect/duplicate line when starting shoots with multiple girls.",
            "- Fixed the wrong panties being referenced at times in panty collection."
        ]
    },
    "0.311": {
        "Added": [
            "- Added sponsor experience system, working with sponsors and fulfilling requests now gives XP. Leveling up increases contract limit and unlocks new sponsors.",
            "- Sponsors now have several new stats associated with them which influences their requests including lewdness, report chance, requested amount and payments.",
            "- Added choosing between girl and mother requests when contacting sponsors for additional requests.",
            "- Added selected and required item count to sponsor request selection menu header text.",
            "- Added new sponsor option when calling to remove all requests and generate that many new ones.",
            "- Added pre-exam inspection where you can check girls for rule breaks and confiscate forbidden items.",
            "- Added new exam outro screen.",
            "- Added assigning homework to girls after class.",
            "- Added stat breakdown after sex interactions.",
            "- Added title text to menu when girl offers panties after sex.",
            "- Added clinic and 'male enhancement' upgrades.",
            "- Added support for 'disabling' academy upgrades.",
            "- Added several new gift options to trait other attributes. ",
            "- Added 3 new rules which increase tuition fees.",
            "- Added option to enable and disable rules outside of pta meetings, accessed from computer.",
            "- Added tooltips for various player stats.",
            "- Added option to select and change your portrait, can be accessed from your stats page.",
            "- Added 'autosave' toggle when starting a new game or NG+, since it causes a noticable stutter.",
            "- Added shortcuts to quickly go to class, office and pta meetings from bedroom door.",
            "- Added option to skip Saturday/Sunday when sleeping.",
            "- Made mother expectations visible on exam inspection screen.",
            "- Added coloured bars for arousal, pressure and exam progress.",
            "- Made use of coloured bars to show stat changes after sex/exams.",
            "- Added explanation to corruption level trait tooltips.",
            "- Made forced vote and tolerated status visible on girl review screen.",
            "- Made forced tolerated status visible on home visit call screen.",
            "- Added third level of clothing damage where it is complete destroyed.",
            "- Added toggle for autosaves when sleeping, can be enabled/disabled from preferences.",
            "- Added naming saves, can be enabled/disabled from preferences.",
            "- Added prompt to skip weekends, can be enabled/disabled from preferences.",
            "- Added tracking loaded girl mods to saves and a tooltip showing missing/added girls.",
            "- Added tutorial for organising shoots.",
            "- Added tutorial for girl review screen.",
            "- Added tutorial for sponsor overview screen.",
            "- Added tutorial for specific sponsor screen.",
            "- Re-added 'kissing' as a sexual favor option."
        ],
        "Changes": [
            "- Exams now use time rather than rounds, so less impactful actions don't feel as wasteful for the player.",
            "- Locked some better paying sponsors until later on.",
            "- Changed event tooltip when checking in girl review menu.",
            "- Changed various enable/disable buttons to radio buttons for clarity.",
            "- Made prestige and reputation visble during pta meetings.",
            "- Increased how much shoot willingness corrupted girls will have on average.",
            "- Decreased how much impact shoot item willingness is reduced by girl stats.",
            "- Added event cooldown to girls cheating in exam.",
            "- Added 'brown' check to 'generate_color_from_string' function, so it should avoid hard to read brown text colours.",
            "- Lowered sponsor relationship gain from fulfilling requests.",
            "- Rebalanced shoot willingness calculation to use average lewdness rather than weighting toward initial shot lewdness average.",
            "- Rebalanced the trait rarity of a few of the more impactful traits.",
            "- Minimum and maximum number of traits generated on girls now scales with academy prestige.",
            "- Super-Legendary trait rarity now scales with academy prestige.",
            "- Clothing which breaks rules and is removed during an exam is now confiscated.",
            "- Sponsors with requests are now sorted to the top.",
            "- Videoshoot videos now loop when shot.",
            "- Sponsors will now check sent photos and videos when checking if request can be completed.",
            "- 'free_use_compliance' now scales off corruption and naturism rather than affection.",
            "- Improved pass, expel and alumni tooltips.",
            "- Added stat changes for 'sexy_maid_outfit', 'buttplug' and 'vibrating_buttplug' gifts.",
            "- Lowered the stat changes for the 'flowers' gift but also lowered its cost.",
            "- 'Honest' trait now raises max report chance, it functions the same except corrupted girls won't report actions they shouldn't.",
            "- Girls will now try to match their outfits and wear clothing they would have skipped if it doesn't break any rules.",
            "- Helping or watching mastubating girls before class will now give the player an erection at the start of class.",
            "- Made hud visible during home visits.",
            "- Dresses now block wearing outer wear."
            
        ],
        "Fixed": [
            "- Fixed girl specific 'home_visit' events triggering when visiting someone else.",
            "- Fixed enacting and voting rules being inverted.",
            "- Fixed various arousal checks to make sure they account for stat changes.",
            "- Fixed exam inspection dialogue being incorrect when girls accept inspection.",
            "- Fixed mother votes not always being displayed.",
            "- PTA president doesn't try arguing your case for rules she doesn't agree with.",
            "- Fixed possible error when trying to sort sponsors.",
            "- Fixed 'home_visit' events not triggering.",
            "- Fixed possible errors about new event attributes when loading old saves.",
            "- Fixed possible error during mother report call for sponsor requests.",
            "- Fixed photo and videoshoot softcore rule difficulty being swapped.",
            "- Added check to clothing value when resolving stolen clothing so pta president doesn't care about pennies.",
            "- Fixed error when ending events early.",
            "- Girl specific events now update their chance to happen variables.",
            "- Fixed events not adding to girl rating if exactly 1 event is found.",
            "- Fixed teachers not being unassigned correctly.",
            "- Fixed some visual bugs when visually showing clothing damage, it still has some bugs with images with incorrect aspect ratios.",
            "- Fixed mothers weekly update never being ran.",
            "- Fixed various issues related to girl event cooldowns.",
            "- Fixed 'during_exam' events counting towards girl frequency cooldown.",
            "- Fixed sex interactions ending immediately when updating old saves.",
            "- Fixed various inconsistencies during the end of sex interactions.",
            "- Fixed girl events ignoring their cooldowns.",
            "- Fixed girls leaving panties unwashed check being inverted.",
            "- Fixed 'outfit' clothing sometimes showing bare body images.",
            "- Fixed 'outfit' clothing not randomly selecting image indexes.",
            "- Fixed girls 'day_joined' being set when appying not being accepted.",
            "- Fixed daily updates not being ran when skipping the weekend.",
            "- Fixed force wearing gifted clothing leading to incorrect outfits.",
            "- Fixed errors where modded girl and mother ID's overlap."
        ],
        "Removed": [
            "- Removed a lot of 'fluff' dialogue which got annoying and repetitive. Such as when leave for the academy/home."
        ],
        "Modding Additions": [
            "- Added overriding mothers by adding a 'daughter_override.txt'; i.e mods/mothers/Raylene/daughter_override.txt' with the girl id within the file i.e lulu_chu",
            "- Added option to see missing 'main' video tags in girl ratings menu.",
            "- Events now support having a different chance to happen first their first trigger and any subsequent triggers.",
            "- Added 'dream' event support that happens when the player sleeps in the evening.",
            "- Added 'put_participants_on_cooldown' argument to events, if False event won't reset participant event frequency. Defaults to True",
            "- Added 'blocked_layers' support to clothing, allowing listed layers to be blocked."
        ]
    }
}