{
    "0.314e": {
        "Fixed": [
            "- Fixed error when accessing academy navigation and no faculty is assigned."
        ]
    },
    "0.314d": {
        "Fixed": [
            "- Fixed possible error when opening girl review menu, caused by 'selected_girl' being a mother."
        ]
    },
    "0.314c": {
        "Changes": [
            "- Major rework to video matching calculations."
        ],
        "Modding Changes": [
            "- Added 'pop up' support for modders.",
            "- Opened adding new 'inclusive' webm tags to modders. See 'game/scripts/databases/webm_inclusive_tag_database_ren.py' for details",
            "- Added 'lewdness_comfortability_range' support to clothing, allowing girls to buy and wear clothing if their lewdness comfort is within this range. See 'game/scripts/main_classes/girl/clothing/class_clothing_ren.py' for details"
        ]
    },
    "0.314b": {
        "Fixed": [
            "- Fixed error about 'financial_need' during home visit success call.",
            "- Fixed exam intro strings referring to girls socks rather than shoes."
        ]
    },
    "0.314a": {
        "Fixed": [
            "- Fixed error about missing 'socks.webp' image file.",
            "- Updated game version to match patch notes."
        ]
    },
    "0.314": {
        "Added": [
            "- Added widget to show worn socks below shoes if they can been seen.",
            "- Added menu to quickly check girl overviews in various locations.",
            "- Added missing 'lingerie' tag to 'lace_bra' clothing item.",
            "- Clicking participant faces during shoots now selects them.",
            "- Allowed users to modify 'girl video bonus' and 'recently used penalty' for videos in the settings menu.",
            "- Made girl mother and possible mothers visible on girl recruitment screen."
        ],
        "Changes": [
            "- Major rework to video matching calculations.",
            "- You can now freely go back and forth from daughter's room during home visits.",
            "- Increased use of 'desaturate_image' to show when something is unavailable.",
            "- Removed unnecessary dialogue from encourage and disturb exam actions.",
            "- Encourage Girls exam action now provides a small answer progress bonus.",
            "- Disturb Girls exam action now provides a small answer progress penalty, separate from the penalty caused by increasing pressure.",
            "- If all girl shoots are locked the 'locked' and 'completed' filters are ignored, this is when starting shoots.",
            "- 'maths' homework now increases intellect."
        ],
        "Fixed": [
            "- Fixed punishment requirements not returning correctly if they have no forced/disallowed types or tags.",
            "- Fixed videoshoot videos reporting have no thumbnails where they in fact do.",
            "- Fixed various errors when using debug options to generate all girls and/or alumni.",
            "- Fixed player referring to his own cock negatively."
        ],
        "Modding Changes": [
            "- Added WIP debug screen to show possible generic video tag errors. REQUIRES DEBUG MODE",
            "- Allowed adding to video replacement tags, allowing new video variants for remove, strip and tear actions. i.e 'remove_lower' -> 'remove_jeans'\nSee 'game/scripts/databases/webm_tag_replacement_database_ren.py' for details.",
            "- Allowed adding to custom weighting for mod specific videos. i.e Making hair colour worth +10 vs +3 for all your mods videos.\nSee 'game/scripts/databases/webm_tag_replacement_database_ren.py' for details.",
            "- Allowed adding to video clothing match tags. This avoids double matching if multiple of these tags around found i.e 'skirt' and 'short_skirt' or mismatch penalties if none of these tags are found in the video name.\nSee 'game/scripts/databases/webm_clothing_tags_ren.py' for details."
        ]
    },
    "0.313e": {
        "Changes": [
            "- Girls and their mother's assholes and pussies are now much more resilient and harder to wear out."
        ],
        "Fixed": [
            "- Punishments now update to get any missing or changed attributes.",
            "- Fixed errors when trying to add punishments to existing saves."
        ]
    },
    "0.313d": {
        "Fixed": [
            "- Fixed error when completing requests."
        ]
    },
    "0.313c": {
        "Changes": [
            "- Moved force pta vote and force tolerated actions to new punishment system."
        ],
        "Fixed": [
            "- Added checks to make sure you can't try tear clothing that cannot be damaged.",
            "- Fixed girl arrows in exam cycling in reverse.",
            "- Changed 'give_hint' reaction line to be more appropriate.",
            "- Fixed various widgets colours being reversed.",
            "- Fixed clothing not being removed when destroyed by a 'tear' action.",
            "- Fixed unlocked rules being carried over when starting a new game.",
            "- Fixed errors when checking punishment requirements.",
            "- Fixed punishments not being removed when they should."
        ],
        "Modding Changes": [
            "- Added 'clear_on_monday' option to punishments allowing them to be removed on Monday regardless of remaining duration."
        ]
    },
    "0.313b": {
        "Fixed": [
            "- Fixed crash when trying to start home visits.",
            "- Fixed errors when exam actions try to apply impacts.",
            "- Fixed punishments requirements not returning True when expected."
        ]
    },
    "0.313a": {
        "Fixed": [
            "- Fixed compatibility function causing errors when girls have broken rules."
        ]
    },
    "0.313": {
        "Added":[
            "- Added new exam actions which try to tear the girls clothing.",
            "- Added changing girls buttplug vibration level during exams.",
            "- Added indicators to show needed arousal and pressure for 'vulnerable state'.",
            "- Sponsors now cover a portion of the shoot costs based on the given items.",
            "- Made player reputation, cash and academy funds visible during exams.",
            "- Added toggle for right-click menu closing shortcut.",
            "- Add hotkeys to various buttons and hud elements.",
            "- Added hotkeys for quick-save/quick-load in F5 and F9 respectively.",
            "- Added option for 1 week of tolerated actions while discussing punishments during home visits.",
            "- Added new academy attendance punishments, 'no underwear', 'lingerie only', 'underwear only'.",
            "- Recruitment screen now shows available videos and video tag counts."
        ],
        "Changes": [
            "- Improved webm match rating system, videos should match much better if the tags are available.",
            "- Adjusted balance of 'vulnerable state' calculation.",
            "- Adjusted balance of exam action report chance.",
            "- Adjusted balance of shoot item willingness costs.",
            "- Clothing actions are now reported only if successful rather than unsuccessful.",
            "- Improved performance of exam menus.",
            "- Added back the exam subjects overview option.",
            "- Simplified the shoot complaining and ending dialogue.",
            "- Girls wearing buttplugs during sex have their arousal increase each turn.",
            "- Added check for mother masturbating if home visit call was to daughter.",
            "- The player now refers to the girls faces with adjectives during facials.",
            "- Random mothers are now only generated when accepted rather than when girls are generated.",
            "- Reworked how punishments are handled from being hardcoded to much more systemic, allowing easier expansion.",
            "- Girls and mothers are now paid and purchase clothing on a Friday rather than Sunday.",
            "- Selecting teachers or teaching assistant from navigation will take you to them if available."
        ],
        "Fixed": [
            "- Fixed possible wrong name being displayed during dialogue.",
            "- Fixed pantyhose is now correctly shown to be covering ass/pussy even when damage is being visually shown.",
            "- Girl regeneration button now uses the old refresh button rather than the on button.",
            "- Fixed typo is 'force_rimjob' acceptance calculation name.",
            "- Fixed incorrectly sized shoot cover images pushing text out of box.",
            "- Fixed being able to do some exam actions you shouldn't be able to if you aren't the one doing the actions.",
            "- Fixed girls referring to the player when its his assistant doing the action.",
            "- Fixed errors when trying to replace variables in certain strings.",
            "- Fixed thirdparty female tags not always being added or removed during exams.",
            "- Fixed report and success chances not updating after interacting with teaching assistant.",
            "- Fixed not being able to scold girls when you should.",
            "- Fixed being able to close in game screens when certain game menus are up.",
            "- Fixed the exam action time being reduced BEFORE the girl answers, limiting her answering time.",
            "- Fixed videos not playing at all if no matching race is found.",
            "- Fixed buttplug widget not being visible during sex interactions.",
            "- Made sure panties and buttplugs are correctly taken after sex, exams and confiscating clothing.",
            "- Fixed error when checking girl review related to events.",
            "- 'girl_review_clear' is now only called if home visit calls were successful, which should fix missing info when reopening review menu.",
            "- Various fixes and changes to 'masturbate openly' player action.",
            "- RuleManager 'update_rule_list' now cleared deleted rules.",
            "- Fixed being able to close portrait selection during intro.",
            "- Fixed being able to call girls who have passed or been expelled."
        ],
        "Modding Changes": [
            "- Changing a mothers daughter_id to 'random' on existing saves should work now if the mother hasn't been assigned yet, rather than maintaining original ID.",
            "- Added 'report_multiplier' and 'success_multiplier' attribute to exam actions.",
            "- Girl ratings now also check for custom 'legs' images.",
            "- Added methods to force girls topless or clothing portraits to be displayed. These are 'force_topless_portrait', 'force_clothed_portrait' and 'reset_forced_portrait' and can be called using 'selected_girl.force_topless_portrait()'"
        ]
    }
}