{
    "0.353": {
        "Fixed": [
            "- Fixed girls being added to academy twice during some events. With save fixing function."
        ]
    },
    "0.353-beta": {
        "Added": [
            "- Some rules now increase the target discipline for students in the academy. Their discipline will slowly increase to try meet it.",
            "- Game over scenarios now allow starting a new game+ run and have new dialogue based on performance."
        ],
        "Changes": [
            "- Inspecting underwear before the exam now requires passing a new rule.",
            "- Added requirements to most rules to encourage both accepting new girls and generating alumni.",
            "- Lowered faculty unlock requirements to 1 alumni from 2.",
            "- Some rules now increase the target discipline for students in the academy.",
            "- Added different intro lines for multiple stupid girls.",
            "- Added information to homework tooltips to clarify lessons.",
            "- Changed daily updates to run BEFORE the day index is increased(for simplicity)."
        ],
        "Fixed": [
            "- Fixed error when opening class assignment screen after starting new game plus.",
            "- Fixed only 1 pop up showing rather than all queued pop ups.",
            "- Fixed girl clothing images being added as body images.",
            "- Fixed possible errors when getting event chance to happen after modifying their chance to happen in the settings menu.",
            "- Fixed 'onanist' trait dialogue line using wrong girl variable.",
            "- Fixed classes not being generated when taking shortcut to class.",
            "- Fixed girl grades possibly decaying before the graduation check."
        ],
        "Modding Changes": [
            "- Reworked action force levels and buttplug vibration levels. Making them much more moddable and customizable.",
            "- Added 'can_be_removed' argument to Traits, allowing earned traits to be permanent."
        ]
    },
    "0.352b": {
        "Fixed": [
            "- Fixed yet another error when trying to retrieve patch notes..."
        ]
    },
    "0.352a": {
        "Fixed": [
            "- Fixed error when trying to retrieve patch notes..."
        ]
    },
    "0.352": {
        "Added": [
            "- Added warning text to various screen to make sure players know which girls have grade warnings.",
            "- Graduation ceremonies now also create an influx of applications.",
            "- Added participant name filtering to shoot studio search bar.",
            "- Girl grades can now also be adjusted in the 'modify girl stats' cheat menu.",
            "- Clicking the girls face on application screen now shows quick overview of her stats.",
            "- Added 'intellect_grade_influence' to help balance grades gained from class and homework subjects. Now girls with low intellect won't get the full grades from more advanced subjects."
        ],
        "Changes": [
            "- All actions can now make the player cum during sex interactions to stop infinitely spamming actions.",
            "- Viewing class assignment menu before tutorial happens disables the tutorial.",
            "- Cumming during certain exam events now uses up remaining actions.",
            "- Sponsors no longer count days with pending requests towards their mid week request refresh.",
            "- Transferring money to the academy now shows up as income.",
            "- Hovering an exam action now also previews grade changes.",
            "- Classes are now only generated when the exam starts or if the player didn't go to class. This means you can the change schedule in your office before the exam.",
            "- If an action targets a girls clothing her naturism influences its arousal and pressure impacts.",
            "- How long until a girl loses motivation during exams now scales with her arousal and pressure.",
            "- Quick stat overview now also shows grade targets.",
            "- Rewrote 'confiscate clothing' and 'train attribute' labels to avoid any possible rollback issues.",
            "- Reloading a save from the main menu ALWAYS does hard file reload."
        ],
        "Fixed": [
            "- Fixed 'finger ass' using wrong database entry name meaning its impacts weren't being applied.",
            "- 'home_visit_call' when visiting mother now checks if its her first home visit rather than her daughter's.",
            "- Begging sponsors with low relationship now correct ends the call.",
            "- 'Male Endurance Enhancement Stage 2' now gives the correct +40 max arousal.",
            "- Fixed exam and sex actions that don't target a specific girl not applying their impacts.",
            "- Fixed error when going to class after starting new game plus.",
            "- Fixed error when trying to unassign subjects in class management screen.",
            "- Fixed error during MMF sex interactions(Debug only).",
            "- Fixed sponsor request payments not scaling with how many items are requested.",
            "- Fixed 'home_visit_call' events not triggering.",
            "- Fixed the previous week transaction history referencing current week.",
            "- Add support for referencing sponsor founder in report lines using 'sponsor_founder'.",
            "- Fixed exam inspection dialogue lines when inspection underwear.",
            "- Fixed 'tease_lower' exam event playing the wrong video.",
            "- Fixed girl orgasm videos repeating during some during exam events.",
            "- Limited how much pressure some during exam events can cause if the girl wasn't scared.",
            "- Inserting a vibrating buttplug during the exam now correctly gives you access to its vibration levels.",
            "- Fixed lewdness influences tooltip for clothing having an 'n' rather than a new line.",
            "- Fixed error when trying to use sponsor founder in dialogue."
        ],
        "Modding Changes": [
            "- Added missing shoe related tags to 'valid_webm_main_tags'.",
            "- Using '[academy]' in dialogue now shows the academy name.",
            "- Added 'cutscene' argument to 'show_video', allows the video to play once and the label to continue afterwards. You should NOT add a 'pause' after this, dialogue can also NOT happen during this.",
            "- Added 'loop' argument to 'show_video', allows the video to play once. You should add a 'pause' or dialogue after this, dialogue can happen during this.",
            "- 'generic_action_player_choose_cum' label now handles threesomes rather than needing to use 'threesome_player_choose_cum'."
        ]
    },
    "0.351b": {
        "Fixed": [
            "- Fixed error when cumming on a girl's panties.",
            "- Fixed when cumming on said panties the player just referring to the panties as just their name i.e 'Thong'.",
            "- Fixed the 'kiss' example mod impacts."
        ]
    },
    "0.351a": {
        "Fixed": [
            "- Fixed possible error when getting patch notes."
        ]
    },
    "0.351": {
        "Added": [
            "- Added new exam actions which try to tear the girls clothing.",
            "- Added changing girls buttplug vibration level during exams.",
            "- Added indicators to show needed arousal and pressure for 'vulnerable state'.",
            "- Sponsors now cover a portion of the shoot costs based on the given items.",
            "- Made player reputation, cash and academy funds visible during exams.",
            "- Added toggle for right-click menu closing shortcut.",
            "- Add hotkeys to various buttons and hud elements.",
            "- Added hotkeys for quick-save/quick-load in F5 and F9 respectively.",
            "- Added option for 1 week of tolerated actions while discussing punishments during home visits.",
            "- Added new academy attendance punishments, 'no underwear', 'lingerie only', 'underwear only'.",
            "- Recruitment screen now shows available videos and video tag counts.",
            "- Added widget to show worn socks below shoes if they can been seen.",
            "- Added menu to quickly check girl overviews in various locations.",
            "- Added missing 'lingerie' tag to 'lace_bra' clothing item.",
            "- Clicking participant faces during shoot setup now selects them.",
            "- Allowed users to modify 'girl video bonus' and 'recently used penalty' for videos in the settings menu.",
            "- Made girl mother and possible mothers visible on girl recruitment screen.",
            "- Exam Rework, girls now need to maintain their grades rather than answer enough questions to pass.",
            "- Added 'motivation' system to exams. Which influences action stat growth, success chance and report chance.",
            "- Added graduation ceremony event that triggers on Sundays if any girls can be passed.",
            "- Added class and subject scheduling for both the player and other teachers.",
            "- Added pressure and arousal increase/decrease previews when hovering exam and sex action.",
            "- Added new 'stress relief' dialogue options to secretary.",
            "- Added widget to see panty lewdness and value during exam.",
            "- Added panty lewdness and value to tooltip when confiscating clothing.",
            "- Added new classroom upgrades to increase girl capacity.",
            "- Added new homework subject 'advanced physics'.",
            "- Added 'friends of the game' button to main menu.",
            "- Added option to automatically progress shoots.",
            "- Added quick navigation menu while in the office.",
            "- Added exam and exam actions tutorials.",
            "- Added game over conditions if too many girls leave.",
            "- Added a way to set homework subjects for all students from academy management.",
            "- Added hotkeys to quickly switch tabs and days of the week for class assignment and academy management.",
            "- Hovering clothing during inspection now shows the rules it breaks.",
            "- Girls now track all previously broken rules for future use.",
            "- Added 'minutes_since_interaction' to girls. Which tracks how long since an action was performed on them.",
            "- Added 'kind' trait.",
            "- Added traits to girl quick overview.",
            "- Added 'advanced physics' as a exam subject.",
            "- Added new upgrades for shoot studio.",
            "- Added punishment options to forgive grade warning.",
            "- Added outlines to speaking character names, to help see them on certain backgrounds.",
            "- Added teaching assistant action example mod.",
            "- Added some new videos."
        ],
        "Changes": [
            "- Improved webm match rating system, videos should match much better if the tags are available.",
            "- Adjusted balance of 'vulnerable state' calculation.",
            "- Adjusted balance of exam action report chance.",
            "- Adjusted balance of shoot item willingness costs.",
            "- Clothing actions are now reported only if successful rather than unsuccessful.",
            "- Improved performance of exam menus.",
            "- Added back the exam subjects overview option.",
            "- Simplified the shoot complaining and ending dialogue.",
            "- Girls wearing buttplugs during sex have their arousal increase each turn.",
            "- Added check for mother masturbating if home visit call was to daughter.",
            "- The player now refers to the girls faces with adjectives during facials.",
            "- Random mothers are now only generated when accepted rather than when girls are generated.",
            "- Reworked how punishments are handled from being hardcoded to much more systemic, allowing easier expansion.",
            "- Girls and mothers are now paid and purchase clothing on a Friday rather than Sunday.",
            "- Selecting teachers or teaching assistant from navigation will take you to them if available.",
            "- Major rework to video matching calculations.",
            "- You can now freely go back and forth from daughter's room during home visits.",
            "- Increased use of 'desaturate_image' to show when something is unavailable.",
            "- Removed unnecessary dialogue from encourage and disturb exam actions.",
            "- Encourage Girls exam action now provides a small answer progress bonus.",
            "- Disturb Girls exam action now provides a small answer progress penalty, separate from the penalty caused by increasing pressure.",
            "- If all girl shoots are locked the 'locked' and 'completed' filters are ignored, this is when starting shoots.",
            "- 'maths' homework now increases intellect.",
            "- PTA concerns now groups multiple of the same concern together for a single dialogue scene.",
            "- Concerns now get an importance boost based on how many concerned parties there are.",
            "- Remade game intro sequence.",
            "- Made purchasing 'scissors' a requirement for tear exam actions.",
            "- Girls will now complain about poses before just leaving shoots, except poses WAY out of there comfort.",
            "- Player arousal from girl outfits now scales with the duration of the action.",
            "- Girl 'outfit_pressure' now scales with the duration of the action.",
            "- Moved the majority of girl capacity increases to classroom upgrades.",
            "- Moved various academy management screens to a single screen.",
            "- 'Give Hint' exam action now increase girls grades slightly.",
            "- 'Encourage' and 'Disturb' girls exam actions now increase and decrease motivation respectively.",
            "- Player arousal increase based on girl outfit lewdness now takes exam action duration into account.",
            "- Certain events now show as unavailable on weekends.",
            "- Events where requirements aren't met will now show that over being on cooldown.",
            "- Changed Girl 'try_break_rule' calculations to try make them more accurate to their corruption level.",
            "- Rather than giving an error when getting a line from an empty database it will return an empty string.",
            "- Girls no longer get startled when giving them a hint.",
            "- Improved Exam and Sex action impacts tooltip.",
            "- Reworked player arousal levels to a 100 scale.",
            "- Changed default PC background, to help me testing without NSFW images.",
            "- 'well used' and 'gaping' orifice no longer grip the players cock(description).",
            "- Clothing owners are now set to None when the player steals them.",
            "- Sponsors now only request shoots with specific tags if there are enough items to fulfill them.",
            "- Made requirement descriptions for shoots slightly easier to read.",
            "- Not confronting cheating girls also gives them a grade bonus.",
            "- Max confiscated clothing now also increases with girls corruptio and naturism.",
            "- Expanded 'tease_upper', 'tease_lower' and 'girl masturbating' during exam event.",
            "- Player weekly bonus now scales off how many mother's grade expectations you meet.",
            "- 'exam_global_action_encourage_girls' now already slightly increases tolerance.",
            "- Moved action tracking code to generic action labels.",
            "- Moved impacts and action tracking to the various 'generic' actions, this should make them more consistent(outside of exam and sex).",
            "- Traits can now be given a display name rather than having one automatically generated.",
            "- Praising/Scolding girls during exam intro now applies some stat changes. Such as motivation.",
            "- Events which are ended early are no longer added to girl/player event trackers.",
            "- Negative arousal and pressure impacts will now increase a girls tolerance.",
            "- Player stats screen now shows float values too i.e 0.5 compassion.",
            "- Generic actions now also apply impacts to the person doing the action if it's not the player.",
            "- Exam intro tutorial now only shows if you can do an inspection.",
            "- Rebalanced and simplified pta voting code.",
            "- Prevented scolding girls if all her current clothing is in order, i.e after removing something that broke rules.",
            "- Sponsors now check to make sure enough items with a tag exist before requesting them.",
            "- Sponsors checks now exclude items from girls who are unavailable unless they are unlocked.",
            "- The 'narrator' now always speaks in italics, even without using the text tag.",
            "- Girls who have broken 30+ rules while enrolled can now be expelled.",
            "- EventManager now tries all combinations to check if any participant matches requirements. Mainly noticed in events which require multiple participants.",
            "- Rebalanced sponsor request payments and player bonuses.",
            "- Uniforms can now be enforced as long with other rules which previously conflicted.",
            "- Trait 'treated_as_active_rules' now supports the base game subjects as well.",
            "- Rebalanced how many photos and videos sponsors can request.",
            "- Sponsor requests photo/video 'nudity' requirement now shows even when a specific tag is required.",
            "- Increased the maximum value range of clothing. Meaning you can make more from selling it.",
            "- Blackmarket panty sales now give 50% more rather an 50% less.",
            "- Moved event participant generating to after it is added to the queue to improve performance.",
            "- If girl ratings are sorted by rating they use first name as a secondary sorting point.",
            "- Limited sponsor commends/performance bonuses to 2 per week. You still get the XP bonus just no phone call passed that.",
            "- Willingness from payment now displayed the amount of willingness gained rather than what it adds to the base.",
            "- Rebalanced shoot willingness 'cost' based on corruption levels and shoot lewdness.",
            "- Added willingness impact multiplier based on length of shoots. Makes very long modded shoots a bit easier to complete."
        ],
        "Fixed": [
            "- Fixed possible wrong name being displayed during dialogue.",
            "- Fixed pantyhose is now correctly shown to be covering ass/pussy even when damage is being visually shown.",
            "- Girl regeneration button now uses the old refresh button rather than the on button.",
            "- Fixed typo is 'force_rimjob' acceptance calculation name.",
            "- Fixed incorrectly sized shoot cover images pushing text out of box.",
            "- Fixed being able to do some exam actions you shouldn't be able to if you aren't the one doing the actions.",
            "- Fixed girls referring to the player when its his assistant doing the action.",
            "- Fixed errors when trying to replace variables in certain strings.",
            "- Fixed thirdparty female tags not always being added or removed during exams.",
            "- Fixed report and success chances not updating after interacting with teaching assistant.",
            "- Fixed not being able to scold girls when you should.",
            "- Fixed being able to close in game screens when certain game menus are up.",
            "- Fixed the exam action time being reduced BEFORE the girl answers, limiting her answering time.",
            "- Fixed videos not playing at all if no matching race is found.",
            "- Fixed buttplug widget not being visible during sex interactions.",
            "- Made sure panties and buttplugs are correctly taken after sex, exams and confiscating clothing.",
            "- Fixed error when checking girl review related to events.",
            "- 'girl_review_clear' is now only called if home visit calls were successful, which should fix missing info when reopening review menu.",
            "- Various fixes and changes to 'masturbate openly' player action.",
            "- RuleManager 'update_rule_list' now cleared deleted rules.",
            "- Fixed being able to close portrait selection during intro.",
            "- Fixed being able to call girls who have passed or been expelled.",
            "- Fixed punishment requirements not returning correctly if they have no forced/disallowed types or tags.",
            "- Fixed videoshoot videos reporting have no thumbnails where they in fact do.",
            "- Fixed various errors when using debug options to generate all girls and/or alumni.",
            "- Fixed player referring to his own cock negatively.",
            "- Fixed error about 'financial_need' during home visit success call.",
            "- Fixed exam intro strings referring to girls socks rather than shoes.",
            "- Fixed error about 'financial_need' during home visit success call.",
            "- Fixed exam intro strings referring to girls socks rather than shoes.",
            "- Girl overview menu now disappears when confiscating clothing.",
            "- Girl overview menu now disappears when starting a sex interaction.",
            "- Clothing value now takes it's damage level into account.",
            "- Fixed players getting serious warnings from sponsors when they shouldn't.",
            "- Fixed incorrect missing clothing image icon.",
            "- Ensured 'temporary_girl' is cleared to avoid 'teleporting' bug.",
            "- Fixed bug were mothers could have the personality linked to the incorrect object.",
            "- 'exam_round_tolerance_update' now takes exam action duration into account.",
            "- Fixed possible error if selected girl was no cleared when opening girl review screen.",
            "- Fixed possible error when reloading a save on the girl recruitment screen.",
            "- Fixed possible infinite loop when girls 'purchase_new_clothing'.",
            "- MotherManager 'get_random_mother_configs' now takes used mother IDs into account to prevent duplicate mothers.",
            "- Fixed sex interaction endings, not knowing if player came or not.",
            "- Fixed possible error when generating new mothers after a mother mod has been deleted.",
            "- Fixed empty new line in trait description.",
            "- Fixed vertical photo previews being too small.",
            "- Fixed shoot items possibly not getting lewdness bonuses from some sub tags.",
            "- ExamManager 'exam_action_impact_ranges' now also takes global, player and teaching assistant actions into account.",
            "- Fixed dialogue issues in exam intro when inspecting underwear.",
            "- Fixed girl resume's showing incorrect strings.",
            "- Fixed academy upgrades weekly costs always being negative.",
            "- Fixed shared shoots being added to girls shoots if they are within her folder.",
            "- Fixed shoot items not getting sub tags added correctly.",
            "- Fixed 'virgin' adjectives never being used.",
            "- Fixed the 'both' facial option appearing multiple times during sex interactions.",
            "- Fixed Girls being available for exam events when they shouldn't be.",
            "- Fixed some clothing images having blurry sections.",
            "- Improved the text alignment of some tutorials.",
            "- Fixed white edge artifacts around some icons and portraits.",
            "- Improved layout of pta president selection screen.",
            "- Girl rating sorting is now remembered and correctly sorted when reopening the screen.",
            "- Sponsor menu now remembers your scroll position.",
            "- Selected girl and shoots now update correctly when changing settings and searching on shoot studio screen.",
            "- Girls who have left the exam now ignore some event availability checks. To make sure they are available for events.",
            "- Fixed tolerance stat range being inverted making 'during exam' events much less common than they should be.",
            "- Fixed weird dialogue ending during the 'caught girl masturbating' event.",
            "- Sponsor requests which require a tag i.e 'bikini' now have their pay scaled correctly to the reduced amount requested.",
            "- Fixed 'pta_president' possibly pointing to a copy of the mother.",
            "- Fixed error about 'all_other_mothers' not being set during pta president votes.",
            "- Fixed girls not being unassigned from classes when they are passed/graduate/are expelled.",
            "- Fixed video inconsistencies when the person doing the action isn't the player.",
            "- 'get_stat_growth_multiplier_for_stat' now shows the correct base value.",
            "- Classmate bonuses are now only applied when starting class rather than when classes are generated.",
            "- Fixed cum covered statuses not being cleared when clothing is washed.",
            "- 'generic_action_rimjob' will now use the correct lesbian video if the player isn't doing the action."
        ],
        "Modding Changes": [
            "- Changing a mothers daughter_id to 'random' on existing saves should work now if the mother hasn't been assigned yet, rather than maintaining original ID.",
            "- Added 'report_multiplier' and 'success_multiplier' attribute to exam actions.",
            "- Girl ratings now also check for custom 'legs' images.",
            "- Added methods to force girls topless or clothing portraits to be displayed. These are 'force_topless_portrait', 'force_clothed_portrait' and 'reset_forced_portrait' and can be called using 'selected_girl.force_topless_portrait()'",
            "- Added WIP debug screen to show possible generic video tag errors. REQUIRES DEBUG MODE",
            "- Allowed adding to video replacement tags, allowing new video variants for remove, strip and tear actions. i.e 'remove_lower' -> 'remove_jeans'\nSee 'game/scripts/databases/webm_tag_replacement_database_ren.py' for details.",
            "- Allowed adding to custom weighting for mod specific videos. i.e Making hair colour worth +10 vs +3 for all your mods videos.\nSee 'game/scripts/databases/webm_tag_replacement_database_ren.py' for details.",
            "- Allowed adding to video clothing match tags. This avoids double matching if multiple of these tags around found i.e 'skirt' and 'short_skirt' or mismatch penalties if none of these tags are found in the video name.\nSee 'game/scripts/databases/webm_clothing_tags_ren.py' for details.",
            "- Added 'not_' prefix to video tags, fix prefixed tag is found this video will NOT be used.",
            "- Made sure mothers update before girls, allows them to see any daughter_id changes.",
            "- Mother 'daughter_id' now defaults to 'random'",
            "- Fixed girl ratings showing 0 photoshoots if less than 2 shoots are available.",
            "- Made 'game over' conditions moddable, see 'game/scripts/databases/game_over_conditions_database_ren.py' for more details.",
            "- Added new event type 'home_visit_call' which triggers after pleasantries of home visit phone call.",
            "- Added 'tease' and 'show_pussy' callout lines for shoots.",
            "- Improved girl rating screen and it's category ratings and category weights.",
            "- Added support for new 'XP' based attributes, 'modify_stat' now checks for an matching attribute name with the '_xp' suffix.",
            "- Added wardrobe and traits as properties of the Girl class. This means more easily accessing them i.e 'girl.traits'",
            "- Added two new 'wages' variables to academy. 'alumni_base_donation' and 'alumni_base_income' which control how much the donate and how much income they generate weekly.",
            "- Added 'max_shoot_willingness' to Girl class, this clamps their max shoot willingness to this value.",
            "- Made shoot cost moddable by modifying 'academy.shoot_cost_multiplier'.",
            "- Made clothing damage change moddable by modifying 'player.base_clothing_damage_chance'.",
            "- Made exam action force levels and the bonuses they give moddable, this includes clothing damage, success chance and impact changes. See 'game/scripts/main_classes/class_player_ren.py' for more details",
            "- Allowed 'shoot_studio' upgrades to be accessed from academy navigation and computer menu.",
            "- Separated 'trainable_attributes' from Girl/Mother class. It can now be added to like a normal list.",
            "- ExamAction and SexAction no long take impacts they now just take an 'action_entry_name' argument and their impacts are pulled from 'database_action_impacts'. They also add that name to the girls action tracking.",
            "- Tolerated actions now use the above 'action_entry_name' to see if they are tolerated rather than the exam action 'id'",
            "- Added support for 'pending_girl', 'pending_mother', 'left_girl' and 'left_mother' girl_ids to events.",
            "- Added 'or' support to event 'participant_ids' which allows either to be used i.e participant_ids=['girl', ('girl', 'teaching_assistant')]",
            "- Added using '???f' or '???m' for female or male unknown images respectively.",
            "- Allowed overriding speaker image using 'speaker_image_override', this should be set to '' when finished.",
            "- Added 'force_event_cooldown_to_days' and 'force_same_participant_cooldown_to_days' arguments to Events. These can be used to force treating 'during_exam' cooldowns as days.",
            "- Added 'add_to_trait_influences' function to allow modders to more easily add their traits to acceptance calculations.",
            "- Added 'get_sponsor_by_name' to SponsorManager. Can be used to get sponsor i.e sponsor_manager.get_sponsor_by_name('perfect_fit')",
            "- Added 'post_shoot' event type. It also adds 'shoot' and 'shoot_willingness' to it's 'tracked_variables' when being added to queue.",
            "- Sponsor founders are now characters which can be used during dialogue.",
            "- Number of traits generated can now be modified. By changing 'min_traits_vs_prestige' and 'max_traits_vs_prestige', these should be tuples i.e (1, 3)"
        ]
    }
}