{
    "0.453d": {
        "Fixed": [
            "- Fixed mothers giving warning during first week of joining because of 'is_during_grade_grace_period' returning incorrectly."
        ]
    },
    "0.453c": {
        "Fixed": [
            "- Fixed error when trying confiscate clothing during home visits.",
            "- Corrected compatibility update function to fix missing 'requested_amount' errors."
        ]
    },
    "0.453b": {
        "Fixed": [
            "- Fixed error about missing 'requested_amount' attribute from SponsorRequests. Likely caused by removing mods."
        ]
    },
    "0.453a": {
        "Fixed": [
            "- Fixed error when generating classes if you have other teachers."
        ]
    },
    "0.453": {
        "MAJOR UPDATE - REQUIRES FULL DOWNLOAD": [],
        "Added": [
            "- Added 'training' for faculty and staff aka homework for alumni.",
            "- Clicking girl/mother portraits on home visit call menu now shows their stat overview.",
            "- Added 'Go for a walk' dialogue option while at the beach.",
            "- Added lines and videos if a girl other than the selected girl cums during sex interactions.",
            "- Added free action to remove girls buttplug during tease/masturbate exam events.",
            "- Added 'shoot assistant' as faculty job.",
            "- Added system to allow your shoot assistant to complete shoots on your behalf.",
            "- Added input code to unlock all girl videos.",
            "- Added seen/unseen variations for the event notification dots.",
            "- Added generic actions for teasing upper and lower.",
            "- Added tease upper and lower actions for teaching assistant.",
            "- Added toggle in gameplay options to limit girls grades from dropping below weekly targets once met.",
            "- Added uniform selection for students and faculty positions.",
            "- Added viewing and fulfilling sponsor requests from the shoot studio menu.",
            "- Added new adjectives for various body parts.",
            "- Added 'prioritize assign order' option to gameplay settings. If true the game will try assign mothers based on the order a girl id appears in their configs i.e index 0 over another mothers index 1.",
            "- Added 'taken assignment' option to gameplay settings. If true mothers who have had all their defined daughter ids taken by other mothers she can be assigned to other girls.",
            "- Added prompts to remove and insert correct buttplugs during exam inspection.",
            "- Added new 'rule_uniform_home_confiscation' as prerequisite to confiscating clothing during home visits.",
            "- Added inviting mothers to various academy locations.",
            "- Added unavailable tooltip to calling girls into office and clinic.",
            "- Added gameplay option to allow girls to get bored of repeating the same action.",
            "- Added gameplay option to scale exam impacts based on how long until that action becomes tolerated.",
            "- Added gameplay option and sliders(to PC) to scale exam impacts on the rest of the class.",
            "- Added flash boobs, ass and pussy as teaching assistant actions.",
            "- Added new event where girls can flash various parts during exam.",
            "- Added new descriptions for stripping actions, including 'negative' ones.",
            "- Added grace period tooltips to various grade checks.",
            "- The game now remembers if you assistant was helping or teaching from the last class."
        ],
        "Changes": [
            "- 'event_wrapper' now makes sure 'person_doing_action' is the player.",
            "- Allowed tearing pantyhose and stockings while the girl is wearing shoes.",
            "- Girls with vibrating buttplugs can no longer cum while wearing while its turned off.",
            "- 'buttplug_orgasm' videos now show if another girl in class cums regardless of the select girl cumming or not.",
            "- Limited sponsor calls to 1 per day.",
            "- Limited additional requests from a sponsor to a max of 3 per week.",
            "- Limited resetting sponsor requests to once per week.",
            "- Removed relationship penalty for resetting requests.",
            "- Added 'solo_male' as a sub tag when the player masturbates in class. So modders can also use this tag elsewhere.",
            "- Selected girl name now scales in size based on its length and center aligned the text.",
            "- ImageManager now returns the daughters home backgrounds to avoid mismatches.",
            "- Literature changes: Intellect influence reduced from 50% to 35%, Added 10% affection gains and reduced corruption gains from 12.5% to 7.5%",
            "- Philosophy changes: Intellect influence increased from 50% to 60%, Max grades increased from 7.5 to 8.5 and reduced fear gains from -20% to -15%",
            "- Prevented fingering and fucking girls ass if she is wearing a buttplug during tease/masturbate exam events.",
            "- Removed affection gains for cumming on food and in drinks, now only girls who like it will gain affection.",
            "- ImageManage 'get_first_face_image' will now ignore cum covered image variants.",
            "- When starting a new game+ and selecting girls you now get a warning when you have enough(if you don't want to fill roster).",
            "- Improved cum covered parts tooltips.",
            "- Cumming in a girls drink at the bar when she doesn't want you to can now result in getting kicked out.",
            "- Improved performance on webm review screen.",
            "- Reduced font sizes for mobile version.",
            "- You can no longer confiscate clothing forced by rules.",
            "- Stealing clothing now takes time, and girls entering the locker room while you are in there doing it can result in negative outcomes.",
            "- Allowed inviting alumni to locations within the academy.",
            "- Phone calls now ignore topless state of girl being spoken to (for portrait).",
            "- Increased 'used_webm_penalty' value range from (-20, 0) to (-50, 0)",
            "- Changed girl review layout to give traits more space to be displayed.",
            "- ImageManager 'get_first_face_image' tries to return images without trait tags first. i.e images with 'slut' in the name.",
            "- Limited the size of 'mother_selection_menu' and added a scrollbar.",
            "- Girls who choose to give you a blowjob during 'exam_player_action_masturbate_openly' no longer get pressure or tolerance impacts from it.",
            "- Limited 'aroused girls' during 'exam_player_action_masturbate_openly' to girls with less than 50 pressure.",
            "- 'annoyed_girl' during 'exam_player_action_masturbate_openly' now also gets a fear impact applied.",
            "- Moved 'get_next_item_callout' out of the ShootBase class.",
            "- Changed various walk discussions to use their own acceptance calculation.",
            "- Allowed phoning after 6pm, mainly to allow inviting to locations.",
            "- Girls grades now start at 0 and their mother expectation changes based on her starting intellect rather than her base grades.",
            "- Limited girls to 1 rule break per rule/punishment.",
            "- Increased 'solo_male' mismatch penalty to -999 to avoid them playing when they shouldn't.",
            "- Rebalanced 'post_exam_improve_stats' intellect increase to make the maximum more achievable.",
            "- Added caps for 3 mother expectation targets: 40, 65 and 95 for each respectively.",
            "- Exam action 'fuck boobs' now takes torn clothing into account.",
            "- Event 'home_event_bribe_enroll' now tries to assign a real mother before triggering.",
            "- Greatly improved the performance of the 'get_matching_files' function.",
            "- Improved computer tab button text size for longer strings.",
            "- Changed academy location image and added a second floor.",
            "- Removed 'home_visit_mother_caught_masturbating' from event options and increased corruption requirements from 20 to 40.",
            "- Disabled blowjob description for 'generic_action_blowjob' since they are included in the girls reaction lines.",
            "- 'girl_quick_overview' now shows additional stat information as well.",
            "- Allowed sorting by shoot proficiency and people skill during girl assignment.",
            "- 'confidence_boost_program' and 'professional_makeover' upgrades now also lower shoot willingness costs by 5% each.",
            "- The player now gets paid on Sunday morning before the graduation.",
            "- On Monday the player and the academy now gets a bonus based on the number of graduates.",
            "- Allowed girls to purchase clothing if its matches their job tag even if it has 'can_be_purchased' set to False.",
            "- Sponsor requests now get a payment bonus up to 125% based on the average match rating of the given items.",
            "- Added right-click to clear selected sponsor request items.",
            "- 'go_for_a_walk' acceptance calculation now takes player reputation into account.",
            "- Normalized gui widgets to the same style.",
            "- Added separate button to set girls fear in 'modify stats' screen.",
            "- Removed daily 'discipline' decay for girls.",
            "- Allowed assigning homework from quick overview screen.",
            "- WebmHelper 'has_custom_video' now tags specific tags into account, i.e 'tp_fem' for threesomes.",
            "- Girl 'get_shoot_willingness' now scales past 500 in payment, used to estimate cost of shoots.",
            "- Lowered 'uniform_stockings' lewdness from 5 to 4.",
            "- Now closing exam intro shows inspection if not shown yet that morning.",
            "- Changed 'database_fullbody_image_tags' sorting. To try better match what the girl is wearing.",
            "- Changed trait colours in menus to an outline to improve readability.",
            "- Limited some office events until after class to avoid missing class.",
            "- Allowed mothers to be assigned as bartenders.",
            "- Disabled showing damaged clothing images until it is working correctly.",
            "- Estimated grade and stat changes now take multipliers into account.",
            "- Reduced 'onepiece_swimsuit' lewdness from 12 to 8.",
            "- 'onepiece_swimsuit' now blocks wearing bra and panties.",
            "- EventManager 'should_do_event' now uses a divider to normalize chance to happen based on the number of events of that name are being checked.",
            "- Reduced 'grope_pussy' other girls corruption from (250, 750) to (125, 375). To bring it in line with other actions.",
            "- Increased needed corruption + naturism for max lewdness clothing from 120 to 160.",
            "- 'rule_photo_club_facility' no longer needs alumni to be voted in but does require the dedicated shoot facility.",
            "- Rewrote exam 'tease' event options to avoid repeated code.",
            "- SponsorRequest now skips 'non_gen' tagged clothing to avoid 60+ lewdness requests.",
            "- Improved exam subject selection to better communicate which subjects have been taught.",
            "- Increased patch note frame size to improve readability.",
            "- Event categories on the 'modify_events_menu' are now foldable elements.",
            "- Webm 'girl_id_tags' now supports prefixes and suffixes.",
            "- Webm review menu now shows 'girl' tags as a separate list.",
            "- Improved Event 'get_event_tooltip' cooldown lines for participant cooldowns.",
            "- Rebalanced during exam event cooldowns since the cooldown checks now work correctly."
        ],
        "Fixed": [
            "- Fixed 'person_doing_action' having their webms be included in video selection.",
            "- Fixed 'selected_girl' showing up in 'wear_cum_covered_panties' descriptions after exams.",
            "- Fixed girls thinking you have came in their drink even if you didn't.",
            "- Fixed unlocked store items not showing up in the store correctly.",
            "- Fixed 'post_exam_event_student_threesome' participant_requirements, they were changed during testing.",
            "- Fixed only girls panties getting covered in their cum.",
            "- Fixed Clothing 'get_lewdness_influences' using actual lewdness rather than base.",
            "- Fixed 'threesome_facial_both' not covering clothing in cum.",
            "- Fixed 'get_valid_events' not working correctly for mothers outside of hang out locations.",
            "- Fixed shoot time estimate being incorrect.",
            "- Improved pass/expel dialogue weirdness if started during home visit call.",
            "- Fixed not being able to re-insert stolen buttplugs.",
            "- Fixed 'clinic' location checking for 'teachers_lounge' as its event type for dialogue options.",
            "- Corrected 'is_shoot_studio_hours' times.",
            "- Fixed 'cum_slut' increasing 'face' rather than 'mouth' sensitivity.",
            "- Fixed being able to assign alumni girls homework or call about expelling/passing them.",
            "- Fixed 'home_visit_grope_mother_pussy' leverage cost showing -1 rather than -2",
            "- Added error catching to 'color_text' and 'get_color_based_on_value' functions.",
            "- Fixed impacts during 'exam_player_action_masturbate_openly' being applied twice.",
            "- Fixed shoot updating functions not adding NEW photos/videos to girls shoots.",
            "- Fixed load photo/videoshoot methods being run multiple times for shared shoots.",
            "- 'dress_for_work' now passed 'is_for_work' correctly.",
            "- Fixed home visit phone calls leading to reported action rather than reported request discussion.",
            "- Added missing label for 'forget about it' during reported actions phone discussion.",
            "- Fixed 'random_panties' not getting their owner set during girl punishment.",
            "- Fixed sexy nurse clothing tags and the underwear being purchasable.",
            "- Added 'bikini' tag to lewder variations of bikinis.",
            "- Fixed missing comma between beach preferred clothing.",
            "- Fixed 'fix_buttplug_vibration_levels' resetting girls buttplugs on reload.",
            "- Fixed error when 'show images' is enabled in gameplay settings.",
            "- Fixed weird pause if is no video for action is found and descriptions and responses are skipped.",
            "- Fixed two descriptions showing during in 'generic_action_strip_clothing'.",
            "- Fixed not being able to stop interacting with girls during 'tease' events if the player wasn't initially forced to interact with her(based on arousal).",
            "- Fixed videos being filtered out by WebmHelper when they shouldn't.",
            "- Fixed sorting clothing collection now working when selected category is 'all'.",
            "- Added some additional checks to make sure label 'returns' are correct before trying to use them.",
            "- Fixed WebmHelper '_get_match_rating' checking 'girl_id_tags' as part of normal sub tags.",
            "- Fixed 'generate_girls_in_class' possibly assigning the same girl twice.",
            "- Fixed 'player_weekly_wages' showing $0 bonuses.",
            "- Fixed Event 'get_remaining_cooldown' and 'is_off_cooldown' methods returning incorrectly for participant cooldowns.",
            "- Fixed girl getting redressed before outro lines after shoots.",
            "- Fixed 'girl_review_menu' possibly selecting cum covered face images."
        ],
        "Modding Changes": [
            "- Added 'flash_boobs' and 'flash_pussy' main tags for videos, these are used during walks in various locations.",
            "- Changed beach, park and pier 'flash_ass' videos now picks a random flash video based on which the girl has allow any type of flashing to be used.",
            "- Added pre-game hooks, these will be run when a new game is started. Should be appended 'database_pre_game_hooks' i.e database_pre_game_hooks.append('my_label') or database_pre_game_hooks.append(my_func)",
            "- Added post-settings hooks, these will be run when the player closes the setting screen. Should be appended 'database_post_settings_hooks' i.e database_post_settings_hooks.append('my_label') or database_post_settings_hooks.append(my_func)",
            "- Added girl-enroll hooks, these functions will be run when a girl enrolls ONLY APPEND FUNCTIONS, NO LABELS. Functions should be appended to 'database_girl_enroll_hooks' i.e database_girl_enroll_hooks.append(my_func) and are given 'girl' as an argument.",
            "- Added 'database_girl_enter_location_hooks', these functions will be run when a girl enrolls ONLY APPEND FUNCTIONS, NO LABELS. Functions should be appended to 'database_girl_enroll_hooks' i.e database_girl_enroll_hooks.append(my_func). Functions are passed 'girl' and 'girl_list_variable' as arguments.",
            "- Added choice option tooltip support using '|' as a separator, it follows caption|unavailable|available format. i.e 'Attend PTA Meeting|Can only attend on Saturday mornings.|PTA meeting is starting.'",
            "- Added 'filter_requirements' to ExamAction and SexAction. These options won't show up if the requirements are met.",
            "- Added 'filter_requirements' to Subject and HomeworkSubject classes. These options won't show up if the requirements are met.",
            "- Added 'weekly_class_limit' to Subject class which dictates how many times per week the subject can be taught.",
            "- Subject 'requirements' and 'filter_requirements' are now passed which class is being checked. i.e 'player'.",
            "- Added 'shower' to 'valid_webm_sub_tags' to avoid false positive errors.",
            "- Added warnings to girl ratings if the config has multiple participant ids but isn't shared.",
            "- Added 'get_item_from_inventory' method to Player class.",
            "- When calling mother about home visits she is now 'selected_girl', it reverts back to daughter during home visits(until home visit rework).",
            "- Renamed Sponsor 'contract_requirement_description' to 'contract_requirements_description'.",
            "- Added 'girl_requirements' to hang out locations and girl jobs. This means you can limit which girls can hang out and work at locations.",
            "- Girl 'get_current_job', 'is_currently_at_work' and 'get_job_title' now pull information from 'database_job_and_work_hours' to allow modding new ones in.",
            "- Added 'invitable_girls' option to 'database_hang_out_locations' to assign which types can be invited to a location. Defaults to 'possible_girls'.",
            "- Allowed modding in new cum targets using 'database_cum_targets'.",
            "- Allowed modding in cum target replacements using 'database_cum_target_replacements'. This could be used for 'trans' character support.",
            "- Added 'replace_variables_in_text' function which can be used to replace global variables in a string. It can also take 'additional_context' to fill in other variables.",
            "- Added min and max attributes to ExamAction class. To allow influencing success and report chances as well as pressure and arousal impacts using them. See 'game/scripts/main_classes/exam/class_exam_action_ren.py' for more details.",
            "- Event participant_id changes: 'secretary' to 'academy_secretary', 'auxiliary_teacher' to 'teacher'. The now support any new jobs but using their 'job_name' specified in 'game/scripts/databases/girl_jobs_database_ren.py'.",
            "- 'database_map_locations' now supports callable functions for 'available_tooltip', 'unavailable_tooltip' and 'unavailable_notification'.",
            "- 'database_navigation_girl_previews' now supports 'column_count' to specify how many columns can be used for preview images.",
            "- Added custom invite labels, requirements and invitable girls support for hang out locations.",
            "- Added 'show boobs', 'play with ass' and various fisting actions as shoot tags. ",
            "- Added 'force_move' argument to 'move_girl_to_location' function, which will move the girl to a random index if none are available.",
            "- Added callable function support for ExamAction 'requirements' and 'filter_requirements'.",
            "- Added callable function support for map navigation 'tooltip'.",
            "- Added 'database_office_hud_girls' to allow adding to which girls are visible when in your office.",
            "- Added 'database_upgrade_options' to allow adding new upgradable locations.",
            "- Added 'perm_shoot_cost_multiplier' to permanently reduce money cost of shoots.",
            "- Added 'perm_max_shoot_willingness_bonus' to permanently increase the max willingness a girl can have for a shoot.",
            "- Added 'perm_shoot_willingness_cost_multiplier' to permanently reduce willingness cost of shoots.",
            "- Added support for adding new faculty positions.",
            "- Added support for adding new academy locations.",
            "- Added 'temp_available_shoot_girls' which will limit which girls can be selected for shoots. i.e temp_available_shoot_girls = ['riley_reid', 'mia_malkova']",
            "- Added 'temp_skip_shoot_intro_and_outro' which skips shoot 'fluff' intros and outros.",
            "- Added 'temp_shoot_payment_skipped' which allows bypassing payment for shoots.",
            "- Added 'temp_shoot_forced_acceptance' which allows forcing a girls acceptance for the shoot.",
            "- Added 'temp_shoot_willingness_cost_multiplier' which can be used to increase or decrease the willingness cost for the shoot.",
            "- Added 'database_modify_stat_calculations' which controls the final amount applied to the girl when 'modify_stat' is called.",
            "- Renamed 'remove_girl_from_class' to 'remove_girl_from_exam' to avoid duplicate names.",
            "- Acceptance calculations now support 'reputation' as a requirement which checks the player reputation.",
            "- Added 'choices_are_functions' to 'confirm_user_choice' screen, if True it expects functions not labels.",
            "- Added 'database_daily_updates' and 'database_weekly_updates' to mark functions for daily/weekly running.",
            "- Added 'requirements_description' to Trait class.",
            "- Added 'daily_action_tracker' to girls and mothers which tracks the number of times an action has been performed that day.",
            "- Added 'database_new_game_plus_hooks', you can add functions to be run when a new game plus is started i.e resetting variables.",
            "- Added 'sex' video sub tag for when a video is going to be played during sex interactions.",
            "- Added 'student' video sub tag to girls who aren't mothers or alumni.",
            "- Renamed 'scale_impacts' to 'scale_impacts_to_player_force' for clarity.",
            "- Renamed Event 'start_sex_interaction' argument from 'additional_sub_tags' to 'additional_subtags' for consistency.",
            "- Girl and Mother managers now only check specific folders for configs. If your mods are not in '_mods/girls/' or '_mods/mothers' they will NOT be loaded."
        ]
    }
}
