{
    "0.428": {
        "Added": [
            "- Added a lot of code to prevent mods with missing body images causing errors when generating them.",
            "- Added more balanced pressure and arousal impacts for new cumshot and creampie exam actions.",
            "- Girls can now report 'cum' exam actions that are part of another action i.e facial after using her mouth. This may result in 2 reports if she reports the main action as well."
        ],
        "Changes": [
            "- Exam action tutorial now displays the stat tooltips in alphabetical order.",
            "- Slightly decreased size of girls names on the girl review menu to better fit longer girl names.",
            "- Mothers now should their 'free-use' compliance on the girl review menu .",
            "- Cumming on girls food when she contests you will show a video now, was disabled because I couldn't find matching videos but it caused confusion.",
            "- 'pta_discussion_raise_funds' tooltip now takes into account the $1000 that needs to be in the bank.",
            "- Accepting raised funds at PTA meeting no longer gives a reputation penality.",
            "- Raise reputation PTA discussion gets a success bonus based on average mother corruption and affection. Scales from 0-30%"
        ],
        "Fixed": [
            "- Fixed ImageManager 'load_possible_body_images' giving custom mothers generic mother images if they are missing.",
            "- Fixed girls showing home visit event types multiples times if they have multiple events of that type on home visit call screen.",
            "- Fixed Event 'get_remaining_cooldown' returning just the time delta rather than the actual remaining cooldown.",
            "- Fixed Event 'requirements_met' not returning correctly when events have 'participant_ids' but not 'participant_requirements'. It now uses the 'requirements' string if it doesn't reference 'girl' or 'participants'.",
            "- 'get_valid_events_for_girls' now temporary sets selected girl to the given main girl ID. Done for some events which require a 'selected girl'.",
            "- Fixed EventManager 'get_valid_events' overwriting the existing events participants when creating a copy. Caused cooldown checks to return incorrectly.",
            "- Fixed girl specific events not setting their triggered status correctly if its a 'one_time_event'.",
            "- Attempt to fix errors when defaulting fullbody image when girl doesn't have clothed fullbody images."
        ]
    },
    "0.427": {
        "Added": [
            "- Home visit call screen now shows what event types are available if any are.",
            "- Added 'home visit early' event selection menu when visiting girls/mothers."
        ],
        "Changes": [
            "- Added blue to scrollbars to make them more identifiable.",
            "- 'story_event_unlock_upgrades' now checks if you have any alumni when it triggers rather than requiring 2+.",
            "- When traveling to a location girls won't just disappear before you get there(unless they need to get to work).",
            "- You can now only call girls into your office and the clinic after 10 AM or if you have been to class.",
            "- Removed 'clear selection' image in on girl assignment screen when calling girls into your office or the clinic.",
            "- Nurse now warns you when calling a girl into the clinic that the girl currently in the clinic will be sent away.",
            "- Changed event alert widget to green from red."
        ],
        "Fixed": [
            "- Fixed being able to skip time while selecting initial girls.",
            "- 'end_event' now clears sex interactions to prevent 'se_participants' not being cleared.",
            "- 'faculty_unlock_fix' compatibility function now triggers if alumni > 0 rather than > 1(only relevant to older saves).",
            "- Added extra checks to make sure fullbody images are correctly defaulted.",
            "- Fixed 'move_girl_to_location' not working correctly when the given index is 0 and location is full.",
            "- Fixed not calling a girl into the clinic blocking you from using it later.",
            "- Fixed videoshoot videos using the incorrect thumbnails.",
            "- Fixed video not hiding during 'cafeteria_discussion_extra_toppings' label.",
            "- Fixed 'motivation_string' on exam actions menu using 'girl' rather than 'selected_girl'."
        ]
    },
    "0.426c": {
        "Fixed": [
            "- Fixed video not hiding after cumming in girls drink at he bar."
        ],
        "Modding Changes": [
            "- Shorted 'ultimate_whore' video tag to just 'u_whore'."
        ]
    },
    "0.426b": {
        "Fixed": [
            "- Fixed errors related to outline shader by removing it."
        ]
    },
    "0.426a": {
        "Added": [
            "- Added compatibility function to unlock faculty for saves created before event fix."
        ],
        "Changes": [
            "- Added some conditional fallbacks to fullbody images rather than just using clothed variant.",
            "- Made some image matching changes for mothers getting generic images to try avoid mismatched images.",
            "- Free-use compliance tooltips now mention that fear reduces it."
        ],
        "Fixed": [
            "- Made changes to 'smoothstep_outline' shader to try fix errors on certain hardware setups.",
            "- Fixed being able to start a threesome if the daughter isn't at home during 'free use' discussions with mother.",
            "- 'story_event_unlock_upgrades' will now also unlock faculty if you have 2+ alumni when it triggers.",
            "- EventManager now always creates copies of event when checking valid events rather than modifying original if its a 'one time' event."
        ]
    },
    "0.426": {
        "Added": [
            "- Added city navigation map.",
            "- Added stealing and selling any clothing items.",
            "- Added 'nurse' faculty position which will have her working in the clinic.",
            "- Added new visitable locations to school: clinic, cafeteria, locker room.",
            "- Added new visitable locations to map: beach, mall, pier.",
            "- Player 'cum limit' is now visible during sex interactions.",
            "- During sex interactions if the player just came and the girl leaves you will either end early or get a prompt to continue.",
            "- Added sorting options to panty collection and girl recruitment screens.",
            "- Added 'ultimate whore' trait, mainly by modder request to allow 'reward' videos.",
            "- Added 'face'/'mouth' area sensitivity for girls.",
            "- Allowed modding in custom PC backgrounds, you can see the 'game/_mods/pc_backgrounds' folder for more details.",
            "- Added outlines to buttons to make them easier to distinguish between.",
            "- Added button to clear class.",
            "- Allowed marking images as wallpapers and randomizing wallpaper based on them when opening computer.",
            "- Added sorting options to girl assignment screen.",
            "- Added sorting and filtering options to girl review screen.",
            "- Added option to skip the videos and dialogue of strip events during exam.",
            "- Girl body parts can now also be covered in cum.",
            "- Body images will now try to match if the girl has a buttplug and/or part is covered in cum.",
            "- Added 'squirter' trait, which increases how much a girl cums when she orgasms.",
            "- Added option to completely skip the shoot introduction dialogue.",
            "- Added advanced filtering and searching when starting shoots.",
            "- Added 'fake boob' traits for each size.",
            "- Added force buttplug and force vibrating buttplug rules.",
            "- Added 'image_helper', functionally the same as 'webm_helper' but for static images.",
            "- Added event details to girl quick overview screen.",
            "- Added new clothing: 'bikini', 'micro bikini', 'peekaboo bikini', 'mini dress' and 'latex dress'",
            "- Added option to not strip girls when sex interactions start.",
            "- Re-added 'story_event_first_girl_leaving' story event.",
            "- Added options to cum on the girls ass or pussy in various situations.",
            "- Added dialogue option for secretary to call a girl into your office.",
            "- Added sexy nurse outfit, if given to the academy nurse she will wear it to work.",
            "- Added notification how much a girls grades increase during cheating event.",
            "- Added check for unrecognized files in shoot directories i.e incorrect file types.",
            "- Added bikini images for Kiara Cole and Shay Sights.",
            "- Added 'Head to class' and 'Attend PTA meeting' buttons to academy navigation screen.",
            "- You can now set buttplug vibration levels during sex interactions.",
            "- Accessing budget via debug management menu will let you easily add funds.",
            "- Accessing upgrades via debug management menu will let bypass faculty/upgrade requirement, instantly build them and do it for free.",
            "- Added quick 'leave for home' button on city map.",
            "- Added buttons to quickly return/steal all girls clothing during exam outro.",
            "- Added button to allow setting which clothing types to automatically try steal during exam outro.",
            "- Added description variations for graduation ceremony.",
            "- Added toggle to automatically add photos as they are unlocked to random wallpaper pool.",
            "- Added option to add all unlocked photos to random wallpaper pool.",
            "- Added 'database_broken_rule_conflicts' to prevent certain rules giving two rule breaks.",
            "- Added job titles to girl assignment screen.",
            "- Added new bar, beach, cafeteria, coffee shop, park, pier and teachers lounge interaction options.",
            "- Added 'webm' review screen where you can see which girl videos you have unlocked.",
            "- Added starting MMF sex interactions at various locations.",
            "- Added being able to steal clothing from lockers if the locker room is empty.",
            "- Added game over state for missing too many PTA meetings.",
            "- Added options to not help mothers with their tuition during event.",
            "- Added generic mother fullbody images. Thanks to 'Balalaechnik' for providing the images.",
            "- Added choosing the girls mother from the random mother pool when accepting her application.",
            "- Added draggable computer icons which snap to a grid.",
            "- Added PTA meeting room as clickable on academy navigation screen.",
            "- Added notification if 'solo male' videos are skipped.",
            "- Added 'prefer threesome videos' toggle to gameplay settings.",
            "- Added 'job' system where girls can work jobs outside of player appointed ones.",
            "- Home visit call menu now shows if girl/mother have home events(red alert) or events at current location(yellow alert).",
            "- Added phone option to invite girl/mother to current location.",
            "- Added exam and sex actions where you can cum on various parts if you are edging.",
            "- Added gameplay option to enable asking to cum early during certain actions if the player is edging.",
            "- Added two new rules which further increase girl capacity by 5 each."
        ],
        "Changes": [
            "- Clothing now keeps track of who came on/in it and how much cum there is.",
            "- 'Take break' sex action now reduces player arousal by 10 from 5 and girl arousal by 5 rather than 5-10.",
            "- Max student rules now increase capacity by 3 from 2 but require at least one of the classrooms to be renovated.",
            "- 'Being A Slut' homework subject now requires 'Free-Use Law: Act 3' to be passed. It now also increases the girls obedience and people skills.",
            "- Starting sex interactions via debug menu now randomize the girls used.",
            "- Actions which normally don't make the player cum have their arousal impacts on the player reduced by 50% during sex interactions.",
            "- Cumming no longer reduces girls intellect.",
            "- '_exam_round_arousal_change' now raises the girl arousal to 85 rather than not increasing at all if arousal change would tag ger above 85.",
            "- Reduced player arousal from 'pinch_nipple' action from 10 to 5-10.",
            "- When asked to get dressed girls will remark if they didn't wear any clothing to work.",
            "- By popular request girls can again cum from blowjobs/face fucking.",
            "- Shoot review screen now only shows relevant sub tags. i.e They can be requested by a sponsor.",
            "- Forced pantyless and uniform rules no longer conflict.",
            "- SponsorRequest 'get_random_lewdness' now takes requested clothing tags into account.",
            "- Allowed generating mothers with conflicting hair colours if they are all that is left.",
            "- Ending home visits now takes you to navigation screen which allows quickly call another girl or go to another location.",
            "- Homework and class subjects now show their requirements.",
            "- Moved Girl and Mother payment and clothing purchasing to Sunday, to allow purchasing forced clothing types and tags.",
            "- Debug mode can now be disabled by using the same code again.",
            "- Event first trigger chance can now also be modified on the event settings screen.",
            "- Hovering girls during assignment now shows their stats.",
            "- Video tags marked with '_only' now get +3, special tags defined in 'database_special_only_tags' get +10.",
            "- WebmHelper now gets location tags automatically based on location or current event 'type'.",
            "- 'global_current_location_label' now pulls valid labels from 'database_valid_global_location_labels' to allow modding in new locations.",
            "- 'debug_show_management_menu' now opens on the 'rules' tab.",
            "- Normalized and improved 'get_uncovered_parts_tooltip'",
            "- Updated and improved some widget images.",
            "- Increased the number of 'fuck_ass' actions needed for 'anal_slut' from 7 to 10.",
            "- Separated the 'cum_slut' into 'cum_slut' and 'cum_dumpster' based on where the cumshot is(external vs internal)",
            "- Girls now carry over some pressure, arousal and tolerance changes from exam inspection.",
            "- Shortened shoot introduction dialogue.",
            "- You can now modify the universal growth rate for each stat from the computer settings screen.",
            "- Added 'swimsuit' tag to 'onepiece_swimsuit'.",
            "- Daughter stat influence can now be set to 0 so she will not corrupt her mother at all.",
            "- Improved event detailing on girl review screen.",
            "- Mother and daughter full body images now show during home visits if they have one.",
            "- Made all exam actions available during sex interactions.",
            "- 'office_event_secretary_work_late' can now trigger after 2PM rather than after 4PM",
            "- Applying pressure or arousal impacts now also increase fear based on girl corruption.",
            "- Uncorrupted girls now get small amounts of corruption and naturism XP based on the other girl's outfits. So now you can pair girls who dress slutty with uncorrupted girls to boost their corruption speed.",
            "- Various 'step mother' traits should allow mismatched races between girls now.",
            "- Girls now get dressed after sex.",
            "- You can now see all students on graduation screen.",
            "- Buttplugs only apply impacts after inserting.",
            "- Scolding a girl after praising her now removed the 'Praised' buff.",
            "- Removed daily grades decay.",
            "- Clarified what the 'stamina' on the sex menu means.",
            "- Shoots with no valid photos/videos will now be marked as invalid rather than cause an error.",
            "- Improved underwear and buttplug inspection dialogue and added variations for rule breaks vs punishment breaks.",
            "- Clothing lewdness and value now scales off how much cum is on it.",
            "- 'dress_girl_with_clothing_preference' now also generates new body images.",
            "- Girls will now find fullbody images in any folder with 'full' in the name rather than one specifically named 'fullbody'.",
            "- When assigning classes you are now prompted the next empty slot automatically.",
            "- Academy nurse now earns a wage.",
            "- Blocked going to the academy if it's not school or PTA hours.",
            "- School closing time reduced by 1 hour from 4 PM to 3 PM.",
            "- If there is an important concern at the PTA meeting you are now forced to go.",
            "- Girl review screen 'wealth' now also includes her weekly pay from work.",
            "- Moved some options to new 'gameplay settings' menu option.",
            "- Allowed hiding the UI while auto shoot is active.",
            "- Exam intro and fullbody images no longer try to match identifiers. Was causing issues selection issues.",
            "- 'events_set' now gets shuffled before being processed.",
            "- Event generation now ends early if an event has 5 valid combinations (optimization).",
            "- Wrapped config loading code in try blocks to help track down errors.",
            "- Disabled being able to wait around after midnight.",
            "- Sleeping on Saturday morning before 6am will skip prompts and just take you to 7am.",
            "- Made girls with events at a location more likely to visit it.",
            "- Made girl face images consistent on most screens.",
            "- 'rule_max_girls_1' no longer requires any classroom renovations, allowing you to get +3 girl capacity early on.",
            "- Improved event generation performance.",
            "- Mismatched girl names in videos now use penality amount from 'database_webm_tag_mismatch_penalties'.",
            "- Debug option to make some girls alumni now picks them randomly rather than all even numbered girls.",
            "- Home visit call menu now hides girl hud to avoid blocking view.",
            "- Talking to secretary from academy navigation now sets your location to your office."
        ],
        "Fixed": [
            "- Classes are generated in the morning now if the player skips class.",
            "- Fixed cancelled buttplug insertions being reported.",
            "- Fixed possible error checking clothing tags if buttplug was not inserted.",
            "- Fixed error when cancelling passing/expelling girl after calling mother from PC.",
            "- Made sure player and girl 'just_came' flags are reset after actions.",
            "- Made sure player 'just_came' flag is reset after gloryhole.",
            "- Made sure time manager unlocks correctly after interacting with gloryhole.",
            "- Fixed girls which are in class being available in the gloryhole. This is if the player skips class.",
            "- Based sure videos with mismatched races being played when they shouldn't.",
            "- Made sure 'scheduled_auxiliary_teachers' are correctly cleared when starting new game+",
            "- Fixed debug management menu not unlocking rules.",
            "- Fixed possible errors when deleting girls if they are auxiliary teachers.",
            "- Fixed clothing possibly being seen when adding it to girls wardrobe when it shouldn't.",
            "- Fixed possible error when updating stolen buttplugs.",
            "- Debug sex interactions no longer use the 'home visit' end scene.",
            "- Fixed girls 'leaving' sex interactions on the last round.",
            "- Fixed punishments not updating and being removed correctly.",
            "- Fixed no video or lines playing if selected girl cums from buttplug.",
            "- Fixed possible dialogue line issues when giving girls gifts.",
            "- Fixed girls refusing gifts not applying their refuse impacts.",
            "- Girls who have temporarily left class no longer get impacts.",
            "- Shoot 'can_be_attempted' now returns False if its required rule isn't passed.",
            "- Fixed possible issue getting clothing name for reported exam actions when removing shoes.",
            "- Fixed shoes not being checked for rule breaks when removing them(would be tolerated).",
            "- Added missing shoot item sub tags to 'database_shoot_item_sub_tag_lewdness'.",
            "- Fixed teachers not being correctly unassigned when deleting girls and mothers.",
            "- Fixed 'double facial' videos being played when they shouldn't.",
            "- Fixed shoot callouts being incorrect for the fallback options.",
            "- Fixed shoes and buttplugs not being marked as seen.",
            "- Fixed some not setting their return label correctly if their event type was a list.",
            "- Added missing 'lingerie' clothing tag to Lace Panties.",
            "- Fixed not being able to name the academy if skipping intro and selecting girls.",
            "- Fixed 'generic_action_rimjob' using the wrong video tag for female assistant.",
            "- Fixed headmaster 'cb_id' not being set after starting new game+",
            "- Fixed error caused by vibrating buttplugs.",
            "- 'generic_action_player_choose_cum' now makes sure its the player doing the action before continuing.",
            "- Fixed 'exam_event_girl_caught_masturbating' using the wrong sub tags.",
            "- Fixed possible error when getting maintained faculty tooltip.",
            "- 'hovering_autoshoot' should now clear more consistently.",
            "- Fixed clothing not being taken from the girls during exam intro.",
            "- Fixed mothers possibly having mismatched 'clothing_manager' objects.",
            "- Fixed 'get_valid_events' including disabled events and one time events which have triggered.",
            "- Fixed sleeping after midnight skipping a day.",
            "- Fixed 'post_exam_update' doubling grade gain for girls in player class.",
            "- Fixed handjob videos ignoring additional sub tags.",
            "- Fixed gifts not applying any stat changes.",
            "- Attempted fix to shoot screen causing clicks being ignored on mobile.",
            "- Fixed losing some rules with newgame+ when they should be maintained.",
            "- Fixed various issues related to girl data not being updated.",
            "- Fixed 'database_webm_inclusive_trait_tag_mapping' additions not being added to girl webm checks.",
            "- Fixed reported actions not referencing the correct clothing items.",
            "- Fixed mothers bringing up already resolved reported actions/requests.",
            "- Debug options to regenerate girls now clears faculty to avoid errors when opening navigation.",
            "- Fixed pending girls and mothers not having compatibility functions run on them.",
            "- Fixed 'music_class_renovation' only giving 4 girl capacity rather than 5.",
            "- Fixed large stutter when generating events caused by creating deep copies of participants.",
            "- Academy 'refresh_faculty' now clears invalid scheduled faculty.",
            "- Opening academy navigation or academy management now clears invalid scheduled faculty.",
            "- Improved performance on academy navigation and academy management screens by moving image generation into a separate less frequently called function."
        ],
        "Modding Changes": [
            "- Girl body images will now try to match a chosen index if possible. Allowing images sets i.e 'face1' will try to match with 'portrait1', 'boobs1' and so on.",
            "- Girl body images can be tagged using 'cum', 'creampie' and 'bp' to help match scenarios. 'creampie' being used by face, ass and pussy. 'bp' used only for ass and means she is wearing a buttplug.",
            "- Videoshoot thumbnails can now be tagged with ',cover' like photoshoot photos.",
            "- ShootItem 'analyze_item_name' fixes more incorrect tags mainly to do with '_vert' tags added to sub tags.",
            "- Completed sponsor requests now keep track of the girl ids if applicable.",
            "- HomeworkSubject now supports giving girls traits upon lesson completion.",
            "- Gifts now support applying temporary buffs. See 'game/scripts/main_classes/class_shop_item_ren.py' for more details.",
            "- Girl ratings screen now also warns about incorrect shoot main and sub tags.",
            "- Girl ratings will now only be generated once per load rather than every time the screen is opened.",
            "- Girl ratings will now be generated on multiple threads rather than 1 by 1(about twice as fast now).",
            "- Added panty types to clothing tags.",
            "- Changed the way girl id's as video tags is weighted. Should make videos with matching girl ids more common.",
            "- Added 'park' event type, triggered when traveling through it, such as to and from academy.",
            "- Added 'waited_around' variable which is True if the player waited via the HUD. Can be used to limit when your events can/can't trigger.",
            "- Events can check if it was started via dialogue using 'event_started_from_dialogue'.",
            "- Added 'dialogue_text' argument to Event class. This is used as the dialogue option text if event can be started via dialogue.",
            "- Added stand alone 'show_video' and 'hide_video' functions.",
            "- Added 'add_clothing_tags' function which allows more easily adding tags to clothing items.",
            "- Added 'possible_clothing_request_sub_tags' and 'favored_clothing_item_sub_tags' to Sponsors. Allowing sponsors to request items with that tag or favored clothing to get a match bonus.",
            "- Added support for temporary traits by giving them a 'duration_in_days' argument.",
            "- Added 'add_temporary_trait' method to TraitManager.",
            "- Raised 'too many photos' from 35 to 45.",
            "- Raised 'too many videos' from 15 to 30.",
            "- Girl ratings now check image aspect ratios rather than exact dimensions.",
            "- Fixed temporary stat changes not working for area sensitivity i.e 'ass_sensitivity'.",
            "- Added 'webm_tags_for_girls_to_ignore' for GirlRatings clarity.",
            "- Renamed 'actions_already_done' for home visits to 'actions_already_done_home_visit' since the former is now used for other locations.",
            "- Allowed modding in new fullbody image keys and requirements. See 'game/scripts/databases/fullbody_image_tags_ren.py' for more details.",
            "- Added 'database_webm_inclusive_trait_tag_mapping' where you can tag certain traits to add multiple tags i.e 'big_boobs_fake' will also add 'big_boobs' as tag.",
            "- Added support for static images to be shown like videos, these images should be tagged the same as the videos and be put into an 'action_videos' folder within the girl folder.",
            "- Added 'force_orgasm' argument to most generic actions. It forces the target girl to cum if she didn't already.",
            "- Added 'add_to_trait_influences_to_entries' utility function, allows applying 'trait influences' to multiple entries at once.",
            "- Added 'insert_dict_entry_at_index' and 'add_or_merge_entry' utility functions. Can be used to help add new dialogue/descriptions or adjectives.",
            "- Changed how home visit actions are tracked to function more closely to other locations. Mods might been to be update their requirements for this i.e 'my_action' not in actions_already_done -> 'my_action' not in actions_already_done[girl.id].",
            "- Added clothing tag 'non_school' and 'non_work' to prevent girls from wearing it to school/work.",
            "- Added support for modding in different event type 'girl lists'. i.e 'shoot' event types using the girls in the shoot.",
            "- Added support for 'female_orgasm' which will play over 'orgasm' if person doing the action is another girl.",
            "- 'caught cheating' event now pulls its options from several databases allowing users to mod in new options.",
            "- 'generic_action_player_choose_cum' now also sets the 'chosen_cum_action' to the chosen label.",
            "- Added 'hang_out_time' to 'database_hang_out_locations' which allows setting how long girls will hang out at the location.",
            "- Added 'move_girl_to_location' function to simplify changing a girls location.",
            "- Added 'max_visits_per_day' support for locations.",
            "- Added 'maid' tag to 'sexy_maid' clothing.",
            "- Added support for new fullbody images: 'athletic', 'shower', 'maid', 'nurse', 'work', 'uniform', 'swimsuit'.",
            "- Girls will now use images of lower corruption levels but with lowered usage chance.",
            "- Added 'clothing_in_slots_has_tags' method to ClothingManager. Useful for modding in new fullbody image tags.",
            "- Added 'get_trait_by_name' method to TraitManager.",
            "- Adding a temporary trait a girl already has now updates its duration to new application.",
            "- Traits can now apply a universal acceptance bonus with the base stat modifier 'acceptance'.",
            "- Added 'generic_sex_ending' label which handles the ends of solo, MMF and FFM sex interactions.",
            "- Added 'database_mid_day_updates' which allows functions to be called when certain requirements are met. Checked whenever time is skipped.",
            "- Various store item classes now have a correctly default their 'item_type'.",
            "- Improved error logging when configs are malformed.",
            "- Improved error logging for invalid requirement strings.",
            "- WebmHelper now adds girls job as a webm tag if she is the selected girl. i.e 'nurse' or 'secretary'",
            "- Added debug printing for modded girls with missing body images",
            "- 'database_valid_global_location_labels' changed from list to dictionary. Should use your location label as a key and the event type of location as its value. i.e 'show_park: park'",
            "- Added 'participant_requirements' argument to Event class to help improve generation performance, can be ignored for non-generic events. See 'game/scripts/main_classes/event/class_event_ren.py' for more details."
        ]
    }
}
