{
    "0.306": {
        "Fixes": [
            "- Fixed event cooldowns not working, which could lead to spamming events.",
            "- Fixed rule breaks... again... Logic was all correct girls were just having outfits changes after rule breaks were generated."
        ]
    },
    "0.305": {
        "Added": [
            "- Added sponsors requesting videoshoots like photoshoots. As there aren't many videoshoots right now you will need mods for this to activate.",
            "- Moved 'kiss' example action to actual game content and expanded allowing players to try kissing faculty and during home visits.",
            "- Added cheat to reduce vote difficulty during pta meetings by 50%",
            "- Added cheat to lower vote difficulty during PTA meetings.",
            "- Added cheat to double sponsor relationship gain.",
            "- Added cheat to set player reputation to 100.",
            "- Added cheat to set academy prestige to 100."
        ],
        "Changes": [
            "- Fixed girls possibly being in both alumni and student pool.",
            "- Rewrote outift generation, should resolve rule breaks not being registered.",
            "- Rewrote sponsor request generation, it will try match current girl stats and for shoots will weight them towards how many items are available.",
            "- Added stat minimum for girls to skip wearing certain clothing, should resolve uncorrupted girls coming to class topless.",
            "- Changed 'slut' and 'whore' trait colours as they were hard to read.",
            "- Academy maintaince is now paid at the end of the week rather than daily.",
            "- Slightly improved academy budget layout.",
            "- Mothers now have their forced vote set for the week rather than the first rule voted in.",
            "- Limited maximum girl applications per week to 3.",
            "- Fixed girls complaining about stripping their panties after offering them to you after sex.",
            "- Rebalanced sponsor contract payments from 300-1800 to 650-1450.",
            "- Rebalanced mother voting the PTA president.",
            "- Added checks to remove clothing descriptions that reference if the girl is wearing underwear."
        ],
        "Fixes": [
            "- Fixed possible infinite loop when generating girls in exam if not enough girls are available.",
            "- Fixed possible game lock when using NewGame+ and have more girl capacity that possible students.",
            "- Fixed crash when loading a save where girls that were removed are in the current exam.",
            "- Fixed possible error during shoots when shoot item willingness impact drops to 0.",
            "- Fixed several issues caused after starting NG+",
            "- Fixed typos and grammer mistakes.",
            "- Fixed girls not being able to pass on final round of exam.",
            "- Girl recruitment now shows correct capacity when first picking girls.",
            "- Fixed player reputation bar always being empty.",
            "- Fixed remaining actions button and tooltip on pta meeting menu.",
            "- Fixed possible errors when more report calls happen but reported actions/requests have been resolved.",
            "- Fixed being able to purchase faculty upgrades before unlocking them."
        ],
        "Modding Changes": [
            "- Renamed some video and shoot item tags, there is backwards compatibility and the mod tools will be updated to new tags before release.\nA tool to rename existing content will also be released to modders.",
            "- Fixed lesson videos showing as invalid main tags."
        ]
    },
    "0.304": {
        "Added": [
            "- Added cheat code to instantly complete upgrade construction.",
            "- Added slider to girl recruitment menu to set the chance to assign a random mother over an generic one.",
            "- Modded girls/mothers will now have their configs ignored but there content loaded if their 'id' matches an already loaded girl/mother."
        ],
        "Changes": [
            "- Increased base girl capacity by 1."
        ],
        "Fixed": [
            "- Fixed possible infinite loop when generating girls in exam if not enough girls are available.",
            "- Fixed possible game lock when using NewGame+ and have more than 15 girl capacity.",
            "- Fixed crash when loading a save where girls that were removed are in the current exam.",
            "- Fixed possible error during shoots when shoot item willingness impact drops to 0."
        ],
        "Additions": [
            "- Traits now update from database if any changes were made i.e their colour."
        ]
    },
    "0.303": {
        "Fixed": [
            "- Fixed colour of 'whore' trait being hard to read.",
            "- Fixed insert buttplug action showing 'adjective' rather than an actual word.",
            "- Fixed possible error when allowing girl to go the bathroom.",
            "- Fixed girls chance to wear clothing being completely wrong.",
            "- Fixed error when automatically resolving old reported actions and requests."
        ],
        "Additions": [
            "- Traits now update from database if any changes were made i.e their colour."
        ]
    },
    "0.302": {
        "Fixed": [
            "- Fixed error when girl is wearing a buttplug during an exam.",
            "- Fixed chance to wear clothing being inverted making uncorrupted girls more likely to wear no clothing."
        ]
    },
    "0.301c": {
        "Fixed": [
            "- Fixed error when generating events when 'selected_girl' is a mother.",
            "- Fixed error when getting uncovered parts tooltip for damaged socks."
        ]
    },
    "0.301b": {
        "Fixed": [
            "- Fixed possible error when getting and clearing queued call events.",
            "- Fixed error when inserting buttplugs."
        ]
    },
    "0.301a": {
        "Fixed": [
            "- Fixed error when checking whether reported exam actions are tolerated."
        ]
    },
    "0.301": {
        "Fixed": [
            "- Fixed error when an event starts a sex interaction."
        ]
    },
    "0.3": {
        "Added": [
            "- Added new game plus, which allows reseting some or all progress.",
            "- Added navigation menu to academy.",
            "- Added store where you can purchase clothing, sex toys and gifts.",
            "- Added option to choose how forceful your actions are during exam.",
            "- Added clothing damage, damaged clothing allowing you access to items below it.",
            "- Added 'buttplug' clothing items.",
            "- Added 'buttplug' punishments.",
            "- Added removing and inserting buttplugs actions during exam, you can only insert your own or buttplugs the girl originally owned.",
            "- Added removing buttplug action during sex.",
            "- Added gloryhole to bathroom if it's upgrade has been unlocked.",
            "- Added clothing 'outfit_tag' support, allowing several clothing items to be marked as a set to be worn together.",
            "- Added option let give girls panties back at the end of an exam.",
            "- Added 'available funds' to shoot selection menu.",
            "- Added search bar to shoot selection menu.",
            "- Added slider to increase how much a girls stats influence their mother's passive stat growth.",
            "- Washing panties on sponsor request screen now shows the compatibility change too.",
            "- Added cheat option to regenerate girl applications.",
            "- Added debug option to quickly set a girl or all girls stats to 0/25/50/75/100.",
            "- Added 'onanist' trait, where girls are more likely to masturbate and are more accepting of the player masturbating.",
            "- Added new random events: 'Caught Cheating', 'Student Threesome' and 'Mother Caught Masturbating'.",
            "- Added new girls: Dani Daniels, Dillion Harper, Leana Lovings, Lulu Chu, Mia Malkova, Scarlet Skies",
            "- Added new mothers: Angela White, Asa Akira, India Summer, Lauren Phillips"
        ],
        "Changes": [
            "- 'dumb' trait is now removed when girl reaches 30 intellect.",
            "- 'naturist' trait now increases remove and strip action acceptance.",
            "- 'naturist' trait now makes remove exam actions tolerated.",
            "- Changed home visist call hours from 10-19 to 10-18.",
            "- Removed asking where to go after home visit if it's a weekend.",
            "- Made girls with high naturism be less likely to buy more clothing.",
            "- Phone call menu now shows PTA president.",
            "- Phone call menu now highlights when girl or mother has been called today.",
            "- Phone call option from PC now hints if girl/mother are unavailable or been called today.",
            "- 'Shrunk' the lewdness gap in the panty selection.",
            "- Actions when target disallowed clothing are now tolerated.",
            "- RuleManager 'get_which_rules_clothing_breaks' now ignores 'uniform' requirements if another tag is forced i.e 'lingerie'.",
            "- Girls with less class time are now more likely to be chosen for exam.",
            "- Improved shoot selection menu layout slightly, mainly the 'willingness factors' and start button.",
            "- Reduced relationship bonus when first making contact and entering a contract.",
            "- Reduced how a girls stats influence her mother's passive stat growth.",
            "- Rebalanced how much pressure a girl experience when corrupted, they should experience a bit more pressure now even when fully corrupted.",
            "- Rewrote the calculation on how likely or unlikely a girl is to break a rule.",
            "- Rebalanced girl 'distraction' from arousal, pressure and tolerance loss.",
            "- Subjects no longer influence how fast a girl answers the questions.",
            "- Rolled the upgrade unlocks and faculty hint events into one.",
            "- The wash button is now hidden on the sponsor request screen if request requires panties with cum on them.",
            "- Increased video 'match_rating' penality for mismatched corruption levels.",
            "- Reduced 'calculate_arousal_impact' maximum arousal from 125% to 100% original.",
            "- Story event which unlocks faculty will now also unlock upgrades in the case it triggers before that event.",
            "- Changed how many items a sponsor requests, they are now weighted towards lower range.",
            "- Mothers now also forget about old reported actions and requests that are marked for pta action.",
            "- Made girls possible skip purchasing clothing based on their naturism and corruption.",
            "- Made girls possible skip wearing clothing based on their naturism and corruption."
        ],
        "Fixed": [
            "- Fixed exam and sex action impact descriptions.",
            "- Fixed intro images showing naked body images rather than panties in certain cases.",
            "- Fixed girls possibly starting with answer progress when the exam starts.",
            "- Fixed player possibly not getting marked as 'been_to_class'.",
            "- Fixed girls being able to cum from kissing.",
            "- Fixed sponsor request boxes being cut off if too long.",
            "- Fixed clothing items possible using incorrect images if their 'base_image_name' is in another clothing images name.",
            "- Fixed wardrobe items overlapping with title text on girl review screen.",
            "- Fixed alumni and their mothers not having their weekly updates run.",
            "- Fixed various punishments trying to show videos for mother rather than daughter.",
            "- Fixed shoot items possibly not getting the tags the should from their parent shoots.",
            "- Fixed old resolved actions and requests possibly not getting cleared.",
            "- Fixed mothers possibly not clearing their queued report call events."
        ],
        "Modding Additions": [
            "- Added support for girls using custom clothing images over generic ones.",
            "- Added double penetration action tag support for shoots."
        ]
    }
}